# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.messaging.jms.JMSMessages.properties      CDIST1500 - CDIST1549
#
# IMPORTANT:
# Update this number if you add a new message, this is the next
# error number to use for new error messages:
# Next error number:  CDIST????

ATLEAST_ONE_ATTR=CDIST1431E Le port de sortie d'erreur facultatif doit comporter au moins un attribut.
ATMOST_TWO_ATTR=CDIST1430E Le port de sortie d'erreur facultatif ne peut pas comporter plus de deux attributs.
ATTEMPT_TO_RECONNECT=CDIST1527I  Tentative de recr\u00e9ation de la connexion
ATTEMPT_TO_RESEND_MESSAGE=CDIST1540I Tentative de renvoi du message ({0}).
ATTRIB_IN_SPL_SCHEMA_MUST_BE_RSTRING_USTRING_OR_XML=CDIST1476E {0} dans le sch\u00e9ma SPL doit \u00eatre de type rstring, ustring ou xml.
ATTRIB_TYPE_FOR_STREAM_ATTRIB_NOT_SUPPORTED_SPL_TYPE=CDIST1477E Le type d''attribut : {0} pour l''attribut de flux : {1} n''est pas un type SPL pris en charge.
ATTRIB_WITH_TYPE_IN_NATIVE_SCHEMA_CANNOT_BE_MAPPED_TO_ATTRIB_WITH_TYPE=CDIST1478E Le nom d''attribut : {0} avec le type : {1} dans le sch\u00e9ma natif ne peut pas \u00eatre mapp\u00e9 sur l''attribut: {2} avec le type : {3}. 
ATTRIB_WITH_TYPE_IN_NATIVE_SCHEMA_NOT_FOUND_IN_STREAM_SCHEMA=CDIST1479E Le nom d''attribut : {0} avec le type : {1} dans le sch\u00e9ma natif est introuvable dans le sch\u00e9ma de flux.
ATTRIB_WITH_TYPE_IS_INVALID_MUST_BE_STRING=CDIST1480E Le nom d''attribut : {0} avec le type : {1} n''est pas valide. L''attribut doit \u00eatre de type String.
BLOB_NOT_SUPPORTED_FOR_JMSSOURCE=CDIST1481E BLOB n'est pas un type SPL pris en charge pour l'adaptateur JMSSource.
BLOB_NOT_SUPPORTED_FOR_MSG_CLASS=CDIST1482E Le type de donn\u00e9es BLOB n''est pas pris en charge pour la classe de message {0}.
CHECKPOINT=Point de contr\u00f4le {0}...
CHECKPOINT_CANNOT_PROCEED_MISSING_CHECKPOINT_MSG=CDIST1483E Le point de contr\u00f4le ne peut pas continuer, car il attend un message de point de contr\u00f4le qui est introuvable.
CODEPAGE_APPEARS_ONLY_WHEN_MSG_CLASS_IS_BYTES=CDIST1484E La page de codes s'affiche uniquement lorsque la classe de message est bytes.
CONNECTION_TO_JMS_FAILED_DID_NOT_TRY_RECONNECT=CDIST1485E Echec de la connexion \u00e0 JMS. Aucune tentative de reconnexion car la r\u00e8gle est noReconnect
CONNECTION_TO_JMS_FAILED=CDIST1486E Echec de la connexion \u00e0 JMS : {0}
CONNECTION_TO_JMS_FAILED_INVALID_MSG_SELECTOR=CDIST1487E Echec de la connexion \u00e0 JMS. S\u00e9lecteur de message non valide.
CONNECTION_TO_JMS_FAILED_NO_RECONNECT_AS_RECONNECT_POLICY_DOES_NOT_APPLY=CDIST1488E Echec de la connexion \u00e0 JMS. Aucune tentative de reconnexion car la r\u00e8gle de reconnexion ne s'applique pas ici.
CONNECTION_TO_JMS_FAILED_NUMBER_OF_TRIES_EXCEDED=CDIST1489E Echec de la connexion \u00e0 JMS. Le nombre limit\u00e9 de tentatives est d\u00e9pass\u00e9
CONSISTENTREGIONQUEUENAME_CANNOT_BE_SPECIFIED_WHEN_NOT_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1490E Le param\u00e8tre consistentRegionQueueName ne peut pas \u00eatre sp\u00e9cifi\u00e9 lorsque JMSSink ne participe pas \u00e0 une r\u00e9gion coh\u00e9rente
CONSISTENTREGIONQUEUENAME_MUST_BE_SET_WHEN_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1491E Le param\u00e8tre consistentRegionQueueName doit \u00eatre d\u00e9fini lorsque JMSSink participe \u00e0 une r\u00e9gion coh\u00e9rente
CONSISTENTREGIONQUEUENAME_VALUE_MUST_BE_NON_EMPTY=CDIST1492E La valeur consistentRegionQueueName doit \u00eatre une valeur non vide
DEDUPLICATE_MESSAGES=D\u00e9doublonnage des messages...
DISCARD_MSG_TOO_SHORT=CDIST1470W Le message est trop court et a \u00e9t\u00e9 effac\u00e9.
DISCARD_WRONG_MESSAGE_TYPE=CDIST1471W Le message est en cours d''effacement car son type est incorrect. Le type attendu est : {0}.
DISCARD_MSG_UNREADABLE=CDIST1474W Une tentative de lecture d'un message en \u00e9criture seule a \u00e9t\u00e9 effectu\u00e9e et le message a \u00e9t\u00e9 effac\u00e9.
DISCARD_MESSAGE_MESSAGE_FORMAT_ERROR=CDIST1475W La conversion de type n'\u00e9tait pas valide. Le message a donc \u00e9t\u00e9 effac\u00e9.
DISCARD_TRANSACTION_AS_IT_HAS_BEEN_PROCESSED_LAST_TIME=CDIST1493I Effacez cette transaction car elle a \u00e9t\u00e9 trait\u00e9e la derni\u00e8re fois.
DRAIN=Vidange...
ERROR_DURING_RECEIVE=CDIST1472W Une erreur s''est produite lors de l''appel de message de r\u00e9ception par le consommateur {0}
ERROR_DURING_SEND=CDIST1473W Une erreur s''est produite lors de l''appel de message d''envoi par le producteur {0}
ERROR_PORT_ATTR_COUNT_MAX=CDIST1441E Le port de sortie d'erreur facultatif ne peut comporter qu'un attribut.
ERROR_PORT_ATTR_TYPE=CDIST1442E L'attribut dans le port de sortie d'erreur facultatif doit \u00eatre de type rstring.
ERROR_PORT_FIRST_ATTR_RSTRING=CDIST1433E Le premier attribut du port de sortie d'erreur facultatif doit \u00eatre de type rstring.
ERROR_PORT_FIRST_ATTR_TUPLE=CDIST1434E Le premier attribut du port de sortie d'erreur facultatif doit \u00eatre un bloc de donn\u00e9es.
ERROR_PORT_SECOND_ATTR_RSTRING=CDIST1439E Le deuxi\u00e8me attribut du port de sortie d'erreur facultatif doit \u00eatre de type rstring.
EXCEPTION_SINK=CDIST1440E Suppression de ce bloc de donn\u00e9es car une exception s'est produite lors de l'envoi.
FIRST_ATTR_RSTRING=CDIST1432E Lorsque seul l'attribut obligatoire est sp\u00e9cifi\u00e9, le premier attribut doit \u00eatre de type rstring.
IGNORED_DUPLICATED_MSG=CDIST1494I Message en double ignor\u00e9 : {0}
INIT_DELAY_NEG=CDIST1438E La valeur du param\u00e8tre initDelay doit \u00eatre \u00e9gale ou sup\u00e9rieure \u00e0 z\u00e9ro.
INV_VALUE_REC_POLICY=CDIST1435E La valeur du param\u00e8tre reconnectionPolicy doit \u00eatre InfiniteRetry, NoRetry ou BoundedRetry.
INVALID_PROVIDER_URL=CDIST1495E Valeur provider_url incorrecte d\u00e9tect\u00e9e : {0}
LENGTH_ATTRIB_CAN_BE_NONNEG-2-4_ONLY_FOR_MSG_CLASS_BYTES_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1496E L''attribut de longueur peut \u00eatre non n\u00e9gatif ou -2, -4 uniquement pour la classe de message bytes pour le param\u00e8tre : {0} dans le fichier sch\u00e9ma natif.
LENGTH_ATTRIB_SHOULD_BE_NONNEG-2-4_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1497E L''attribut de longueur doit \u00eatre non n\u00e9gatif ou -2, -4 pour le param\u00e8tre : {0} dans le fichier sch\u00e9ma natif.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1498E Aucun attribut de longueur ne doit \u00eatre pr\u00e9sent pour le param\u00e8tre : {0} dans le fichier sch\u00e9ma natif.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_IN_NATIVE_SCHEMA_FOR_MSG_CLASS_BYTES=CDIST1499E L''attribut de longueur doit \u00eatre pr\u00e9sent pour le param\u00e8tre : {0} dans le fichier sch\u00e9ma natif pour la classe de message bytes.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_WITH_TYPE_IN_NATIVE_SCHEMA=CDIST1510E Aucun attribut de longueur ne doit \u00eatre pr\u00e9sent pour le param\u00e8tre : {0} avec le type {1} dans le fichier sch\u00e9ma natif.
MESSAGE_RESEND_NEG=CDIST1429E La valeur du param\u00e8tre {0} ne peut pas \u00eatre n\u00e9gative.
NATIVE_SCHEMA_CANNOT_BE_SPECIFIED_WITH_MSG_CLASS_EMPTY=CDIST1511E Le sch\u00e9ma natif ne peut pas \u00eatre sp\u00e9cifi\u00e9 avec la classe de message Empty.
NATIVE_SCHEMA_CANNOT_CONTAIN_MORE_THAN_ONE_ATTRIB_WITH_MSG_CLASS_TXT=CDIST1512E Le sch\u00e9ma natif ne peut pas contenir plusieurs attributs avec le texte de la classe de message.
NATIVE_SCHEMA_MUST_BE_SPECIFIED_FOR_MESSAGE_CLASS=CDIST1513E Le sch\u00e9ma natif doit \u00eatre sp\u00e9cifi\u00e9 pour la classe de message {0}.
NO_VALID_MSG_CLASS_SPECIFIED=CDIST1514E Aucune classe de message valide n'est sp\u00e9cifi\u00e9e.
OP_CANNOT_BE_START_OF_CONSISTENT_REGION=CDIST1515E L''op\u00e9rateur suivant ne peut pas \u00eatre au d\u00e9but d''une r\u00e9gion coh\u00e9rente : {0}.
PARAM_VALUE_SHOULD_BE_GREATER_OR_EQUAL_TO_ZERO=CDIST1516E La valeur ''{1}'' du param\u00e8tre {0} doit \u00eatre \u00e9gale ou sup\u00e9rieure \u00e0 z\u00e9ro.
PARAMETER_NOT_UNIQUE_IN_NATIVE_SCHEMA=CDIST1517E Le nom de param\u00e8tre : {0} appara\u00eet plusieurs fois dans le fichier sch\u00e9ma natif.
PARAMS_NOT_ALLOWED_WHEN_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1518E Les param\u00e8tres 'reconnectionPolicy', 'reconnectionBound', 'period', 'maxMessageSendRetries' et 'messageSendRetryDelay' ne peuvent pas \u00eatre sp\u00e9cifi\u00e9s lorsque JMSSink participe \u00e0 une r\u00e9gion coh\u00e9rente
PROPERTY_NOT_FOUND_IN_APP_CONFIG=CDIST1519E Propri\u00e9t\u00e9 {0} introuvable dans la configuration d''application {1}.
PROVIDER_URL_MUST_BE_SPECIFIED_IN_CONN_DOC=CDIST1541E Une valeur doit \u00eatre sp\u00e9cifi\u00e9e pour l'attribut provider_url dans le document de connexion.
REC_BOUND_NEG=CDIST1437E La valeur du param\u00e8tre reconnectionBound doit \u00eatre \u00e9gale ou sup\u00e9rieure \u00e0 z\u00e9ro.
REC_BOUND_NOT_ALLOWED=CDIST1436E Le param\u00e8tre reconnectionBound s'affiche uniquement lorsque le param\u00e8tre reconnectionPolicy est d\u00e9fini sur BoundedRetry.
RECONNECTION_EXCEPTION=CDIST1443E Une erreur s''est produite lors de la reconnexion. Erreur : {0}
RECONNECTIONBOUND_CAN_APPEAR_ONLY_WHEN_RECONNECTIONPOLICY_IS_BOUNDEDRETRY=CDIST1542E reconnectionBound {0} peut s''afficher uniquement lorsque le param\u00e8tre reconnectionPolicy est d\u00e9fini sur BoundedRetry. 
RESET_CHECKPOINT=Restauration du point de contr\u00f4le {0} 
RESET_TO_INITIAL_STATE=Restauration de l'\u00e9tat initial...
RETIRE_CHECKPOINT=Suppression du point de contr\u00f4le {0}
STATEHANDLER_CLOSE=Fermeture de StateHandler
TRIGGERCOUNT_PARAM_MUST_BE_SET_WHEN_CONSISTENT_REGION_IS_OPERATOR_DRIVEN=CDIST1543E Le param\u00e8tre triggerCount doit \u00eatre d\u00e9fini lorsque la configuration de la r\u00e9gion coh\u00e9rente est bas\u00e9e sur un op\u00e9rateur
TRIGGERCOUNT_VALUE_SHOULD_BE_GREATER_THAN_ZERO=CDIST1544E La valeur triggerCount {0} doit \u00eatre sup\u00e9rieure \u00e0 z\u00e9ro  
UNSUPPORTED_MSG_CLASSES_FOR_JMSSOURCE=CDIST1545E Les classes de message xml, wbe et wbe22 ne sont pas prises en charge pour JMSSource.
USER_CREDENTIALS_UPDATED=CDIST1546I Les donn\u00e9es d'identification d'utilisateur ont \u00e9t\u00e9 mises \u00e0 jour
USERPRINCIPAL_AND_USERCREDENTIAL_MUST_BE_SET=CDIST1547E Un seul userPrinicpal, userCredential est d\u00e9fini.
VALUE_OF_ACCESS_PARAM_NOT_FOUND_IN_CONN_DOC=CDIST1548E La valeur du param\u00e8tre d''acc\u00e8s {0} est introuvable dans le document de connexions
VALUE_OF_CONNECTION_PARAM_NOT_FOUND_IN_CONN_DOC=CDIST1549E La valeur du param\u00e8tre de connexion {0} est introuvable dans le document de connexions.
VALUE_OF_CONNECTION_PARAM_NOT_THE_SAME_AS_CONN_USED_BY_ACCESS_ELEMENT=CDIST1428E La valeur du param\u00e8tre de connexion {0} est diff\u00e9rente de la connexion utilis\u00e9e par l''\u00e9l\u00e9ment d''acc\u00e8s {1} et qui est mentionn\u00e9e dans l''\u00e9l\u00e9ment uses_connection du document de connexions.
