# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.messaging.jms.JMSMessages.properties      CDIST1500 - CDIST1549
#
# IMPORTANT:
# Update this number if you add a new message, this is the next
# error number to use for new error messages:
# Next error number:  CDIST????

ATLEAST_ONE_ATTR=CDIST1431E A porta de sa\u00edda de erro opcional deve ter pelo menos um atributo.
ATMOST_TWO_ATTR=CDIST1430E A porta de sa\u00edda de erro opcional pode ter um m\u00e1ximo de dois atributos.
ATTEMPT_TO_RECONNECT=CDIST1527I  Tentando recriar a conex\u00e3o
ATTEMPT_TO_RESEND_MESSAGE=CDIST1540I Tentando reenviar mensagem ({0}).
ATTRIB_IN_SPL_SCHEMA_MUST_BE_RSTRING_USTRING_OR_XML=CDIST1476E {0} no esquema spl deve ser do tipo rstring, ustring ou xml.
ATTRIB_TYPE_FOR_STREAM_ATTRIB_NOT_SUPPORTED_SPL_TYPE=CDIST1477E O Tipo de atributo: {0} para o atributo de fluxo: {1} n\u00e3o \u00e9 um tipo de SPL suportado.
ATTRIB_WITH_TYPE_IN_NATIVE_SCHEMA_CANNOT_BE_MAPPED_TO_ATTRIB_WITH_TYPE=CDIST1478E O Nome do atributo: {0} com o tipo: {1} no esquema nativo n\u00e3o pode ser mapeado com o atributo: {2} com o tipo: {3}. 
ATTRIB_WITH_TYPE_IN_NATIVE_SCHEMA_NOT_FOUND_IN_STREAM_SCHEMA=CDIST1479E O Nome do atributo: {0} com o tipo: {1} no esquema nativo n\u00e3o pode ser localizado no esquema de fluxo.
ATTRIB_WITH_TYPE_IS_INVALID_MUST_BE_STRING=CDIST1480E O Nome do atributo: {0} com o tipo: {1} \u00e9 inv\u00e1lido. O atributo deve ser do tipo String.
BLOB_NOT_SUPPORTED_FOR_JMSSOURCE=CDIST1481E BLOB n\u00e3o \u00e9 um tipo de SPL suportado para o adaptador JMSSource.
BLOB_NOT_SUPPORTED_FOR_MSG_CLASS=CDIST1482E O tipo de dados Blob n\u00e3o \u00e9 suportado para a classe de mensagem {0}.
CHECKPOINT=Ponto de verifica\u00e7\u00e3o {0} ...
CHECKPOINT_CANNOT_PROCEED_MISSING_CHECKPOINT_MSG=CDIST1483E O ponto de verifica\u00e7\u00e3o n\u00e3o pode continuar, esperando uma mensagem de ponto de verifica\u00e7\u00e3o, mas n\u00e3o foi localizada.
CODEPAGE_APPEARS_ONLY_WHEN_MSG_CLASS_IS_BYTES=CDIST1484E A p\u00e1gina de c\u00f3digos aparece somente quando a classe de mensagem \u00e9 bytes.
CONNECTION_TO_JMS_FAILED_DID_NOT_TRY_RECONNECT=CDIST1485E A conex\u00e3o com JMS falhou. N\u00e3o houve tentativa de reconex\u00e3o porque a pol\u00edtica \u00e9 noReconnect
CONNECTION_TO_JMS_FAILED=CDIST1486E A conex\u00e3o com JMS falhou: {0}
CONNECTION_TO_JMS_FAILED_INVALID_MSG_SELECTOR=CDIST1487E A conex\u00e3o com JMS falhou. Seletor de mensagem inv\u00e1lido.
CONNECTION_TO_JMS_FAILED_NO_RECONNECT_AS_RECONNECT_POLICY_DOES_NOT_APPLY=CDIST1488E A conex\u00e3o com JMS falhou. N\u00e3o houve tentativa de reconex\u00e3o porque a pol\u00edtica \u00e9 uma pol\u00edtica de reconex\u00e3o que n\u00e3o se aplica aqui.
CONNECTION_TO_JMS_FAILED_NUMBER_OF_TRIES_EXCEDED=CDIST1489E A conex\u00e3o com JMS falhou. O n\u00famero limitado de tentativas foi excedido
CONSISTENTREGIONQUEUENAME_CANNOT_BE_SPECIFIED_WHEN_NOT_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1490E O par\u00e2metro consistentRegionQueueName n\u00e3o pode ser especificado quando JMSSink n\u00e3o estiver participando de uma regi\u00e3o consistente
CONSISTENTREGIONQUEUENAME_MUST_BE_SET_WHEN_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1491E O par\u00e2metro consistentRegionQueueName deve ser configurado quando JMSSink estiver participando de uma regi\u00e3o consistente
CONSISTENTREGIONQUEUENAME_VALUE_MUST_BE_NON_EMPTY=CDIST1492E O valor consistentRegionQueueName deve ser um valor n\u00e3o vazio
DEDUPLICATE_MESSAGES=Deduplicar mensagens ...
DISCARD_MSG_TOO_SHORT=CDIST1470W A mensagem \u00e9 muito curta e foi descartada.
DISCARD_WRONG_MESSAGE_TYPE=CDIST1471W A mensagem est\u00e1 sendo descartada porque o tipo de mensagem est\u00e1 incorreto. O tipo esperado \u00e9: mensagem {0}.
DISCARD_MSG_UNREADABLE=CDIST1474W Foi feita uma tentativa de ler uma mensagem somente grava\u00e7\u00e3o e a mensagem foi descartada.
DISCARD_MESSAGE_MESSAGE_FORMAT_ERROR=CDIST1475W A convers\u00e3o de tipo era inv\u00e1lida. Portanto, a mensagem foi descartada.
DISCARD_TRANSACTION_AS_IT_HAS_BEEN_PROCESSED_LAST_TIME=CDIST1493I Descartar essa transa\u00e7\u00e3o porque ela foi processada pela \u00faltima vez.
DRAIN=Drenar ...
ERROR_DURING_RECEIVE=CDIST1472W Ocorreu um erro durante o recebimento de uma chamada por mensagem pelo Consumidor {0}
ERROR_DURING_SEND=CDIST1473W Ocorreu um erro durante o envio de uma chamada por mensagem pelo produtor {0}
ERROR_PORT_ATTR_COUNT_MAX=CDIST1441E A porta de sa\u00edda de erro opcional pode ter somente um atributo.
ERROR_PORT_ATTR_TYPE=CDIST1442E O atributo na porta de sa\u00edda de erro opcional deve ser um rstring.
ERROR_PORT_FIRST_ATTR_RSTRING=CDIST1433E O primeiro atributo na porta de sa\u00edda de erro opcional deve ser um rstring.
ERROR_PORT_FIRST_ATTR_TUPLE=CDIST1434E O primeiro atributo na porta de sa\u00edda de erro opcional deve ser uma tupla.
ERROR_PORT_SECOND_ATTR_RSTRING=CDIST1439E O segundo atributo na porta de sa\u00edda de erro opcional deve ser um rstring.
EXCEPTION_SINK=CDIST1440E Eliminando esta tupla pois ocorreu uma exce\u00e7\u00e3o durante o envio.
FIRST_ATTR_RSTRING=CDIST1432E Quando somente o atributo obrigat\u00f3rio for especificado, o primeiro atributo dever\u00e1 ser um rstring.
IGNORED_DUPLICATED_MSG=CDIST1494I Ignorada mensagem duplicada: {0}
INIT_DELAY_NEG=CDIST1438E O valor do par\u00e2metro initDelay deve ser zero ou maior que zero.
INV_VALUE_REC_POLICY=CDIST1435E O valor do par\u00e2metro reconnectionPolicy deve ser InfiniteRetry, NoRetry ou BoundedRetry.
INVALID_PROVIDER_URL=CDIST1495E Detectado valor provider_url inv\u00e1lido: {0}
LENGTH_ATTRIB_CAN_BE_NONNEG-2-4_ONLY_FOR_MSG_CLASS_BYTES_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1496E O atributo de comprimento pode ser n\u00e3o negativo -2,-4 somente para bytes da classe de mensagem para o par\u00e2metro: {0} no arquivo de esquema nativo.
LENGTH_ATTRIB_SHOULD_BE_NONNEG-2-4_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1497E O atributo de comprimento deve ser n\u00e3o negativo ou -2,-4 para o par\u00e2metro: {0} no arquivo de esquema nativo.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1498E O atributo de comprimento n\u00e3o deve estar presente para o par\u00e2metro: {0} no arquivo de esquema nativo.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_IN_NATIVE_SCHEMA_FOR_MSG_CLASS_BYTES=CDIST1499E O atributo de comprimento deve estar presente para o par\u00e2metro: {0} no arquivo de esquema nativo para bytes da classe de mensagem.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_WITH_TYPE_IN_NATIVE_SCHEMA=CDIST1510E O atributo de comprimento n\u00e3o deve estar presente para o par\u00e2metro: {0} com o tipo {1} no arquivo de esquema nativo.
MESSAGE_RESEND_NEG=CDIST1429E O valor do par\u00e2metro {0} n\u00e3o pode ser negativo.
NATIVE_SCHEMA_CANNOT_BE_SPECIFIED_WITH_MSG_CLASS_EMPTY=CDIST1511E O esquema nativo n\u00e3o pode ser especificado com a classe de mensagem Vazia.
NATIVE_SCHEMA_CANNOT_CONTAIN_MORE_THAN_ONE_ATTRIB_WITH_MSG_CLASS_TXT=CDIST1512E O esquema nativo n\u00e3o pode conter mais de um atributo com o texto da classe de mensagem.
NATIVE_SCHEMA_MUST_BE_SPECIFIED_FOR_MESSAGE_CLASS=CDIST1513E O esquema nativo precisa ser especificado para a classe de mensagem {0}.
NO_VALID_MSG_CLASS_SPECIFIED=CDIST1514E Nenhuma classe de mensagem v\u00e1lida foi especificada.
OP_CANNOT_BE_START_OF_CONSISTENT_REGION=CDIST1515E O seguinte operador n\u00e3o pode ser o in\u00edcio de uma regi\u00e3o consistente: {0}.
PARAM_VALUE_SHOULD_BE_GREATER_OR_EQUAL_TO_ZERO=CDIST1516E O valor do par\u00e2metro {0} ''{1}'' deve ser zero ou maior que zero.
PARAMETER_NOT_UNIQUE_IN_NATIVE_SCHEMA=CDIST1517E Nome do par\u00e2metro: {0} est\u00e1 aparecendo mais de uma vez no arquivo de esquema nativo.
PARAMS_NOT_ALLOWED_WHEN_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1518E Os par\u00e2metros 'reconnectionPolicy', 'reconnectionBound', 'period', 'maxMessageSendRetries' e 'messageSendRetryDelay' n\u00e3o podem ser especificados quando JMSSink estiver participando de uma regi\u00e3o consistente
PROPERTY_NOT_FOUND_IN_APP_CONFIG=CDIST1519E A propriedade {0} n\u00e3o foi localizada na configura\u00e7\u00e3o de aplicativo {1}.
PROVIDER_URL_MUST_BE_SPECIFIED_IN_CONN_DOC=CDIST1541E Um valor deve ser especificado para o atributo provider_url no documento de conex\u00e3o.
REC_BOUND_NEG=CDIST1437E O valor do par\u00e2metro reconnectionBound deve ser zero ou maior que zero.
REC_BOUND_NOT_ALLOWED=CDIST1436E reconnectionBound aparece somente quando o par\u00e2metro reconnectionPolicy est\u00e1 configurado como BoundedRetry.
RECONNECTION_EXCEPTION=CDIST1443E Ocorreu um erro durante a reconex\u00e3o. O erro \u00e9 {0}
RECONNECTIONBOUND_CAN_APPEAR_ONLY_WHEN_RECONNECTIONPOLICY_IS_BOUNDEDRETRY=CDIST1542E reconnectionBound {0} pode aparecer somente quando o par\u00e2metro reconnectionPolicy estiver configurado como BoundedRetry; caso contr\u00e1rio, n\u00e3o pode aparecer 
RESET_CHECKPOINT=Reconfigurar para o ponto de verifica\u00e7\u00e3o {0} 
RESET_TO_INITIAL_STATE=Reconfigurando para o estado inicial ...
RETIRE_CHECKPOINT=Desativar ponto de verifica\u00e7\u00e3o {0}
STATEHANDLER_CLOSE=Fechamento de StateHandler
TRIGGERCOUNT_PARAM_MUST_BE_SET_WHEN_CONSISTENT_REGION_IS_OPERATOR_DRIVEN=CDIST1543E O par\u00e2metro triggerCount deve ser configurado quando a regi\u00e3o consistente estiver configurada como acionada pelo operador
TRIGGERCOUNT_VALUE_SHOULD_BE_GREATER_THAN_ZERO=CDIST1544E O valor triggerCount {0} deve ser maior que zero  
UNSUPPORTED_MSG_CLASSES_FOR_JMSSOURCE=CDIST1545E As classes de mensagens xml, wbe e wbe22 n\u00e3o s\u00e3o suportadas para JMSSource.
USER_CREDENTIALS_UPDATED=CDIST1546I As credenciais do usu\u00e1rio foram atualizadas
USERPRINCIPAL_AND_USERCREDENTIAL_MUST_BE_SET=CDIST1547E Somente um de userPrinicpal, userCredential est\u00e1 configurado.
VALUE_OF_ACCESS_PARAM_NOT_FOUND_IN_CONN_DOC=CDIST1548E O valor do par\u00e2metro de acesso {0} n\u00e3o foi localizado no documento de conex\u00f5es
VALUE_OF_CONNECTION_PARAM_NOT_FOUND_IN_CONN_DOC=CDIST1549E O valor do par\u00e2metro de conex\u00e3o {0} n\u00e3o foi localizado no documento de conex\u00f5es.
VALUE_OF_CONNECTION_PARAM_NOT_THE_SAME_AS_CONN_USED_BY_ACCESS_ELEMENT=CDIST1428E O valor do par\u00e2metro de conex\u00e3o {0} n\u00e3o \u00e9 igual \u00e0 conex\u00e3o usada pelo elemento de acesso {1}, conforme mencionado no elemento uses_connection no documento de conex\u00f5es.
