# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.messaging.jms.JMSMessages.properties      CDIST1500 - CDIST1549
#
# IMPORTANT:
# Update this number if you add a new message, this is the next
# error number to use for new error messages:
# Next error number:  CDIST????

ATLEAST_ONE_ATTR=CDIST1431E El puerto de salida de error opcional debe tener como m\u00ednimo un atributo.
ATMOST_TWO_ATTR=CDIST1430E El puerto de salida de error opcional no puede tener m\u00e1s de dos atributos.
ATTEMPT_TO_RECONNECT=CDIST1527I  Intentando volver a crear la conexi\u00f3n
ATTEMPT_TO_RESEND_MESSAGE=CDIST1540I Intentando volver a enviar el mensaje ({0}).
ATTRIB_IN_SPL_SCHEMA_MUST_BE_RSTRING_USTRING_OR_XML=CDIST1476E {0} en el esquema spl debe ser de tipo rstring, ustring o xml.
ATTRIB_TYPE_FOR_STREAM_ATTRIB_NOT_SUPPORTED_SPL_TYPE=CDIST1477E El tipo de atributo: {0} para el atributo de corriente: {1} no es un tipo SPL soportado.
ATTRIB_WITH_TYPE_IN_NATIVE_SCHEMA_CANNOT_BE_MAPPED_TO_ATTRIB_WITH_TYPE=CDIST1478E El nombre de atributo: {0} con el tipo: {1} en el esquema nativo no puede estar correlacionado con el atributo: {2} con el tipo: {3}. 
ATTRIB_WITH_TYPE_IN_NATIVE_SCHEMA_NOT_FOUND_IN_STREAM_SCHEMA=CDIST1479E El nombre de atributo: {0} con el tipo: {1} en el esquema nativo no se puede encontrar en el esquema de corriente.
ATTRIB_WITH_TYPE_IS_INVALID_MUST_BE_STRING=CDIST1480E El nombre de atributo: {0} con el tipo: {1} no es v\u00e1lido. El atributo debe ser de tipo String.
BLOB_NOT_SUPPORTED_FOR_JMSSOURCE=CDIST1481E BLOB no es un tipo SPL soportado para adaptador JMSSource.
BLOB_NOT_SUPPORTED_FOR_MSG_CLASS=CDIST1482E El tipo de datos Blob no est\u00e1 soportado para la clase de mensaje {0}.
CHECKPOINT=Comprobaci\u00f3n {0} ...
CHECKPOINT_CANNOT_PROCEED_MISSING_CHECKPOINT_MSG=CDIST1483E La comprobaci\u00f3n no se puede procesar, se esperaba un mensaje de comprobaci\u00f3n, pero no se ha encontrado ninguno.
CODEPAGE_APPEARS_ONLY_WHEN_MSG_CLASS_IS_BYTES=CDIST1484E La p\u00e1gina de c\u00f3digos s\u00f3lo aparece cuando la clase de mensaje es bytes.
CONNECTION_TO_JMS_FAILED_DID_NOT_TRY_RECONNECT=CDIST1485E La conexi\u00f3n a JMS ha fallado. No se ha intentado volver a conectar ya que la pol\u00edtica es noReconnect
CONNECTION_TO_JMS_FAILED=CDIST1486E La conexi\u00f3n a JMS ha fallado: {0}
CONNECTION_TO_JMS_FAILED_INVALID_MSG_SELECTOR=CDIST1487E La conexi\u00f3n a JMS ha fallado. Selector de mensaje no v\u00e1lido.
CONNECTION_TO_JMS_FAILED_NO_RECONNECT_AS_RECONNECT_POLICY_DOES_NOT_APPLY=CDIST1488E La conexi\u00f3n a JMS ha fallado. No se ha intentado volver a conectar ya que la pol\u00edtica es que la pol\u00edtica de reconexi\u00f3n no se aplica aqu\u00ed.
CONNECTION_TO_JMS_FAILED_NUMBER_OF_TRIES_EXCEDED=CDIST1489E La conexi\u00f3n a JMS ha fallado. Se ha excedido el n\u00famero limitado de intentos
CONSISTENTREGIONQUEUENAME_CANNOT_BE_SPECIFIED_WHEN_NOT_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1490E No se puede especificar el par\u00e1metro consistentRegionQueueName cuando JMSSink no est\u00e1 participando en una regi\u00f3n coherente
CONSISTENTREGIONQUEUENAME_MUST_BE_SET_WHEN_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1491E El par\u00e1metro consistentRegionQueueName debe estar establecido cuando JMSSink participa en una regi\u00f3n coherente
CONSISTENTREGIONQUEUENAME_VALUE_MUST_BE_NON_EMPTY=CDIST1492E El valor de consistentRegionQueueName debe ser un valor no vac\u00edo
DEDUPLICATE_MESSAGES=Deduplicar mensajes ...
DISCARD_MSG_TOO_SHORT=CDIST1470W El mensaje es demasiado corto y se ha descartado.
DISCARD_WRONG_MESSAGE_TYPE=CDIST1471W El mensaje se est\u00e1 descartando porque el tipo de mensaje es incorrecto. El tipo esperado es: {0} mensaje.
DISCARD_MSG_UNREADABLE=CDIST1474W Se ha intentado leer un mensaje de s\u00f3lo escritura, y el mensaje se ha descartado.
DISCARD_MESSAGE_MESSAGE_FORMAT_ERROR=CDIST1475W La conversi\u00f3n de tipo no ha sido v\u00e1lida. Por lo tanto, el mensaje se ha descartado.
DISCARD_TRANSACTION_AS_IT_HAS_BEEN_PROCESSED_LAST_TIME=CDIST1493I Descarte esta transacci\u00f3n ya que se proces\u00f3 la \u00faltima vez.
DRAIN=Drenar ...
ERROR_DURING_RECEIVE=CDIST1472W Se ha producido un error durante una llamada de recepci\u00f3n de mensaje del consumidor {0}
ERROR_DURING_SEND=CDIST1473W Se ha producido un error durante una llamada de env\u00edo de mensaje del productor {0}
ERROR_PORT_ATTR_COUNT_MAX=CDIST1441E El puerto de salida de error opcional s\u00f3lo puede tener un atributo.
ERROR_PORT_ATTR_TYPE=CDIST1442E El atributo en el puerto de salida de error opcional debe ser un rstring.
ERROR_PORT_FIRST_ATTR_RSTRING=CDIST1433E El primer atributo en el puerto de salida de error opcional debe ser un rstring.
ERROR_PORT_FIRST_ATTR_TUPLE=CDIST1434E El primer atributo en el puerto de salida de error opcional debe ser una tupla.
ERROR_PORT_SECOND_ATTR_RSTRING=CDIST1439E El segundo atributo en el puerto de salida de error opcional debe ser una rstring.
EXCEPTION_SINK=CDIST1440E Descartando esta tupla ya que se ha producido una excepci\u00f3n durante el env\u00edo.
FIRST_ATTR_RSTRING=CDIST1432E Cuando s\u00f3lo se especifica el atributo obligatorio, el primer atributo debe ser una rstring.
IGNORED_DUPLICATED_MSG=CDIST1494I Mensaje duplicado ignorado: {0}
INIT_DELAY_NEG=CDIST1438E El valor del par\u00e1metro initDelay debe ser cero o mayor que cero.
INV_VALUE_REC_POLICY=CDIST1435E El valor del par\u00e1metro reconnectionPolicy debe ser InfiniteRetry, NoRetry o BoundedRetry.
INVALID_PROVIDER_URL=CDIST1495E Se ha detectado el valor de provider_url no v\u00e1lido: {0}
LENGTH_ATTRIB_CAN_BE_NONNEG-2-4_ONLY_FOR_MSG_CLASS_BYTES_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1496E El atributo de longitud puede ser no negativo o -2,-4 s\u00f3lo para bytes de clase de mensaje para el par\u00e1metro: {0} en el archivo de esquema nativo.
LENGTH_ATTRIB_SHOULD_BE_NONNEG-2-4_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1497E El atributo de longitud debe ser no negativo o -2,-4 para el par\u00e1metro: {0} en el archivo de esquema nativo.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1498E El atributo de longitud no debe estar presente para el par\u00e1metro: {0} en el archivo de esquema nativo.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_IN_NATIVE_SCHEMA_FOR_MSG_CLASS_BYTES=CDIST1499E El atributo de longitud debe estar presente para el par\u00e1metro: {0} en el archivo de esquema nativo para bytes de clase de mensaje.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_WITH_TYPE_IN_NATIVE_SCHEMA=CDIST1510E El atributo de longitud no debe estar presente para el par\u00e1metro: {0} con el tipo {1} en el archivo de esquema nativo.
MESSAGE_RESEND_NEG=CDIST1429E El valor del par\u00e1metro {0} no puede ser negativo.
NATIVE_SCHEMA_CANNOT_BE_SPECIFIED_WITH_MSG_CLASS_EMPTY=CDIST1511E El esquema nativo no se puede especificar con la clase de mensaje Empty.
NATIVE_SCHEMA_CANNOT_CONTAIN_MORE_THAN_ONE_ATTRIB_WITH_MSG_CLASS_TXT=CDIST1512E El esquema nativo no puede contener m\u00e1s de un atributo con el texto de clase de mensaje.
NATIVE_SCHEMA_MUST_BE_SPECIFIED_FOR_MESSAGE_CLASS=CDIST1513E Se debe especificar el esquema nativo para la clase de mensaje {0}.
NO_VALID_MSG_CLASS_SPECIFIED=CDIST1514E No se ha especificado ninguna clase de mensaje v\u00e1lida.
OP_CANNOT_BE_START_OF_CONSISTENT_REGION=CDIST1515E El siguiente operador no puede ser el inicio de una regi\u00f3n coherente: {0}.
PARAM_VALUE_SHOULD_BE_GREATER_OR_EQUAL_TO_ZERO=CDIST1516E El valor ''{1}'' del par\u00e1metro {0} debe ser cero o mayor que cero.
PARAMETER_NOT_UNIQUE_IN_NATIVE_SCHEMA=CDIST1517E El nombre de par\u00e1metro: {0} aparece m\u00e1s de una vez en el archivo de esquema nativo.
PARAMS_NOT_ALLOWED_WHEN_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1518E Los par\u00e1metros 'reconnectionPolicy', 'reconnectionBound', 'period', 'maxMessageSendRetries' y 'messageSendRetryDelay' no se pueden especificar cuando JMSSink participa en una regi\u00f3n coherente
PROPERTY_NOT_FOUND_IN_APP_CONFIG=CDIST1519E No se ha encontrado la propiedad {0} en la configuraci\u00f3n de la aplicaci\u00f3n {1}.
PROVIDER_URL_MUST_BE_SPECIFIED_IN_CONN_DOC=CDIST1541E Se debe especificar un valor para el atributo provider_url en el documento de conexi\u00f3n.
REC_BOUND_NEG=CDIST1437E El valor del par\u00e1metro reconnectionBound debe ser cero o mayor que cero.
REC_BOUND_NOT_ALLOWED=CDIST1436E reconnectionBound aparece s\u00f3lo cuando el par\u00e1metro reconnectionPolicy est\u00e1 establecido en BoundedRetry.
RECONNECTION_EXCEPTION=CDIST1443E Se ha producido un error durante la reconexi\u00f3n. El error es {0}
RECONNECTIONBOUND_CAN_APPEAR_ONLY_WHEN_RECONNECTIONPOLICY_IS_BOUNDEDRETRY=CDIST1542E reconnectionBound {0} aparece s\u00f3lo cuando el par\u00e1metro reconnectionPolicy est\u00e1 establecido en BoundedRetry y no puede aparecer de otra forma
RESET_CHECKPOINT=Restablecer a comprobaci\u00f3n {0} 
RESET_TO_INITIAL_STATE=Restableciendo a estado inicial ...
RETIRE_CHECKPOINT=Retirar comprobaci\u00f3n {0}
STATEHANDLER_CLOSE=StateHandler cerrado
TRIGGERCOUNT_PARAM_MUST_BE_SET_WHEN_CONSISTENT_REGION_IS_OPERATOR_DRIVEN=CDIST1543E El par\u00e1metro triggerCount debe establecerse cuando una regi\u00f3n coherente est\u00e1 configurada en controlada por operador
TRIGGERCOUNT_VALUE_SHOULD_BE_GREATER_THAN_ZERO=CDIST1544E El valor de triggerCount {0} debe ser mayor que cero 
UNSUPPORTED_MSG_CLASSES_FOR_JMSSOURCE=CDIST1545E Las clases de mensaje xml, wbe y wbe22 no est\u00e1n soportadas para JMSSource.
USER_CREDENTIALS_UPDATED=CDIST1546I Se han actualizado las credenciales de usuario
USERPRINCIPAL_AND_USERCREDENTIAL_MUST_BE_SET=CDIST1547E S\u00f3lo se ha establecido userPrinicpal o userCredential.
VALUE_OF_ACCESS_PARAM_NOT_FOUND_IN_CONN_DOC=CDIST1548E No se ha encontrado el valor del par\u00e1metro de acceso {0} en el documento conections
VALUE_OF_CONNECTION_PARAM_NOT_FOUND_IN_CONN_DOC=CDIST1549E No se ha encontrado el valor del par\u00e1metro de conexi\u00f3n {0} en el documento conections.
VALUE_OF_CONNECTION_PARAM_NOT_THE_SAME_AS_CONN_USED_BY_ACCESS_ELEMENT=CDIST1428E El valor del par\u00e1metro de conexi\u00f3n {0} no es el mismo que el de la conexi\u00f3n utilizada por el elemento de acceso {1} tal como se menciona en el elemento uses_connection del documento conections.
