# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.messaging.jms.JMSMessages.properties      CDIST1500 - CDIST1549
#
# IMPORTANT:
# Update this number if you add a new message, this is the next
# error number to use for new error messages:
# Next error number:  CDIST????

ATLEAST_ONE_ATTR=CDIST1431E Der optionale Port f\u00fcr Fehlernachrichten muss mindestens ein Attribut haben.
ATMOST_TWO_ATTR=CDIST1430E Der optionale Port f\u00fcr die Fehlernachrichten kann nicht mehr als zwei Attribute haben.
ATTEMPT_TO_RECONNECT=CDIST1527I Es wird versucht, die Verbindung erneut zu erstellen
ATTEMPT_TO_RESEND_MESSAGE=CDIST1540I Es wird versucht, die Nachricht erneut zu senden ({0}).
ATTRIB_IN_SPL_SCHEMA_MUST_BE_RSTRING_USTRING_OR_XML=CDIST1476E {0} im SPL-Schema muss den Typ rstring, ustring oder xml haben.
ATTRIB_TYPE_FOR_STREAM_ATTRIB_NOT_SUPPORTED_SPL_TYPE=CDIST1477E Attributtyp {0} f\u00fcr Datenstromattribut {1} ist kein von SPL unterst\u00fctzter Typ.
ATTRIB_WITH_TYPE_IN_NATIVE_SCHEMA_CANNOT_BE_MAPPED_TO_ATTRIB_WITH_TYPE=CDIST1478E Attributname {0} mit dem Typ {1} im nativen Schema kann nicht dem Attribut {2} mit dem Typ {3} zugeordnet werden. 
ATTRIB_WITH_TYPE_IN_NATIVE_SCHEMA_NOT_FOUND_IN_STREAM_SCHEMA=CDIST1479E Attribut mit dem Namen {0} und dem Typ {1} im nativen Schema kann im Datenstromschema nicht gefunden werden.
ATTRIB_WITH_TYPE_IS_INVALID_MUST_BE_STRING=CDIST1480E Attribut mit dem Namen {0} und dem Typ {1} ist ung\u00fcltig. Attribut muss den Typ ''string'' haben.
BLOB_NOT_SUPPORTED_FOR_JMSSOURCE=CDIST1481E BLOB wird als SPL-Typ f\u00fcr JMSSource-Adapter nicht unterst\u00fctzt.
BLOB_NOT_SUPPORTED_FOR_MSG_CLASS=CDIST1482E BLOB-Datentyp wird f\u00fcr Nachrichtenklasse {0} nicht unterst\u00fctzt.
CHECKPOINT=Pr\u00fcfpunkt {0}...
CHECKPOINT_CANNOT_PROCEED_MISSING_CHECKPOINT_MSG=CDIST1483E Pr\u00fcfpunkt kann nicht fortgesetzt werden, es wird eine Pr\u00fcfpunktnachricht erwartet, aber es wurde keine gefunden.
CODEPAGE_APPEARS_ONLY_WHEN_MSG_CLASS_IS_BYTES=CDIST1484E Codepage wird nur f\u00fcr die Nachrichtenklasse 'bytes' angezeigt.
CONNECTION_TO_JMS_FAILED_DID_NOT_TRY_RECONNECT=CDIST1485E Verbindung zu JMS ist fehlgeschlagen. Es wurde nicht versucht, die Verbindung wiederherzustellen, da die Richtlinie 'noReconnect' verwendet wird
CONNECTION_TO_JMS_FAILED=CDIST1486E Verbindung zu JMS ist fehlgeschlagen: {0}
CONNECTION_TO_JMS_FAILED_INVALID_MSG_SELECTOR=CDIST1487E Verbindung zu JMS ist fehlgeschlagen. Ung\u00fcltiger Nachrichtenselektor.
CONNECTION_TO_JMS_FAILED_NO_RECONNECT_AS_RECONNECT_POLICY_DOES_NOT_APPLY=CDIST1488E Verbindung zu JMS ist fehlgeschlagen. Es wurde nicht versucht, die Verbindung wiederherzustellen, da die Richtlinie f\u00fcr die Verbindungswiederholung hier nicht angewendet wird.
CONNECTION_TO_JMS_FAILED_NUMBER_OF_TRIES_EXCEDED=CDIST1489E Verbindung zu JMS ist fehlgeschlagen. Die Grenze f\u00fcr die Anzahl der Versuche wurde \u00fcberschritten.
CONSISTENTREGIONQUEUENAME_CANNOT_BE_SPECIFIED_WHEN_NOT_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1490E Parameter consistentRegionQueueName kann nicht angegeben werden, wenn JMSSink nicht an einer konsistenten Region mitwirkt
CONSISTENTREGIONQUEUENAME_MUST_BE_SET_WHEN_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1491E Parameter consistentRegionQueueName muss gesetzt sein, wenn JMSSink an einer konsistenten Region mitwirkt
CONSISTENTREGIONQUEUENAME_VALUE_MUST_BE_NON_EMPTY=CDIST1492E F\u00fcr consistentRegionQueueName muss ein nicht leerer Wert angegeben werden
DEDUPLICATE_MESSAGES=Nachrichten werde dedupliziert...
DISCARD_MSG_TOO_SHORT=CDIST1470W Die Nachricht ist zu kurz und wird verworfen.
DISCARD_WRONG_MESSAGE_TYPE=CDIST1471W Die Nachricht wird verworfen, da der Nachrichtentyp falsch ist. Erwarteter Nachrichtentyp: {0}.
DISCARD_MSG_UNREADABLE=CDIST1474W Es wurde versucht, eine schreibgesch\u00fctzte Nachricht zu lesen, und die Nachricht wurde verworfen.
DISCARD_MESSAGE_MESSAGE_FORMAT_ERROR=CDIST1475W Die Typenkonvertierung ist ung\u00fcltig. Daher wurde die Nachricht verworfen.
DISCARD_MESSAGE_MESSAGE_VARIABLE=CDIST1379W Die Nachricht wurde aus dem folgenden Grund verworfen: {0} 
DISCARD_TRANSACTION_AS_IT_HAS_BEEN_PROCESSED_LAST_TIME=CDIST1493I Diese Transaktion wird verworfen, da sie beim letzten Mal verarbeitet wurde.
DRAIN=Bereinigung...
ERROR_DURING_RECEIVE=CDIST1472W W\u00e4hrend eines Aufrufs des Konsumenten {0} zum Empfangen von Nachrichten ist ein Fehler aufgetreten
ERROR_DURING_SEND=CDIST1473W W\u00e4hrend eines Aufrufs des Producers {0} zum Senden von Nachrichten ist ein Fehler aufgetreten
ERROR_PORT_ATTR_COUNT_MAX=CDIST1441E Der optionale Port f\u00fcr Fehlernachrichten darf nur ein Attribut haben.
ERROR_PORT_ATTR_TYPE=CDIST1442E Das Attribut im optionalen Port f\u00fcr Fehlernachrichten muss den Typ 'rstring' haben.
ERROR_PORT_FIRST_ATTR_RSTRING=CDIST1433E Das erste Attribut im optionalen Port f\u00fcr Fehlernachrichten muss ein rstring-Attribut sein.
ERROR_PORT_FIRST_ATTR_TUPLE=CDIST1434E Das erste Attribut im optionalen Port f\u00fcr Fehlernachrichten muss ein Tupel sein.
ERROR_PORT_SECOND_ATTR_RSTRING=CDIST1439E Das zweite Attribut im optionalen Port f\u00fcr Fehlernachrichten muss ein rstring-Attribut sein.
EXCEPTION_SINK=CDIST1440E Dieser Tupel wird gel\u00f6scht, da beim Senden eine Ausnahmebedingung aufgetreten ist.
FIRST_ATTR_RSTRING=CDIST1432E Wenn nur das obligatorische Attribut angegeben wird, muss das erste Attribut ein rstring-Attribut sein.
IGNORED_DUPLICATED_MSG=CDIST1494I Ignorierte doppelte Nachricht: {0}
INIT_DELAY_NEG=CDIST1438E Der Wert des Parameters initDelay muss gr\u00f6\u00dfer-gleich null sein.
INV_VALUE_REC_POLICY=CDIST1435E Der Wert des Parameters reconnectionPolicy muss InfiniteRetry, NoRetry oder BoundedRetry sein.
INVALID_PROVIDER_URL=CDIST1495E Ung\u00fcltiger Wert f\u00fcr Provider-URL gefunden: {0}
LENGTH_ATTRIB_CAN_BE_NONNEG-2-4_ONLY_FOR_MSG_CLASS_BYTES_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1496E L\u00e4ngenattribut f\u00fcr die Nachrichtenklasse ''bytes'' f\u00fcr den Parameter {0} in der nativen Schemadatei darf nur nicht negativ, -2 oder -4 sein.
LENGTH_ATTRIB_SHOULD_BE_NONNEG-2-4_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1497E Das L\u00e4ngenattribut sollte f\u00fcr den Parameter {0} in der nativen Schemadatei nicht negativ, -2 oder -4 sein.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1498E Das L\u00e4ngenattribut darf f\u00fcr den Parameter {0} in der nativen Schemadatei nicht angegeben werden.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_IN_NATIVE_SCHEMA_FOR_MSG_CLASS_BYTES=CDIST1499E Das L\u00e4ngenattribut sollte f\u00fcr den Parameter {0} in der nativen Schemadatei f\u00fcr die Nachrichtenklasse ''bytes'' angegeben werden.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_WITH_TYPE_IN_NATIVE_SCHEMA=CDIST1510E Das L\u00e4ngenattribut darf f\u00fcr den Parameter {0} mit dem Typ {1} in der nativen Schemadatei nicht angegeben werden.
MESSAGE_RESEND_NEG=CDIST1429E Der Wert des Parameters {0} darf nicht negativ sein.
NATIVE_SCHEMA_CANNOT_BE_SPECIFIED_WITH_MSG_CLASS_EMPTY=CDIST1511E Ein natives Schema kann f\u00fcr die Nachrichtenklasse 'empty' nicht angegeben werden.
NATIVE_SCHEMA_CANNOT_CONTAIN_MORE_THAN_ONE_ATTRIB_WITH_MSG_CLASS_TXT=CDIST1512E Das native Schema darf f\u00fcr die Nachrichtenklasse 'text' nicht mehr als ein Attribut enthalten.
NATIVE_SCHEMA_MUST_BE_SPECIFIED_FOR_MESSAGE_CLASS=CDIST1513E F\u00fcr die Nachrichtenklasse {0} muss das native Schema angegeben werden.
NO_VALID_MSG_CLASS_SPECIFIED=CDIST1514E Keine g\u00fcltige Nachrichtenklasse angegeben.
OP_CANNOT_BE_START_OF_CONSISTENT_REGION=CDIST1515E Der folgende Operator darf nicht der Anfang einer konsistenten Region sein: {0}.
PARAM_VALUE_SHOULD_BE_GREATER_OR_EQUAL_TO_ZERO=CDIST1516E Der Wert ''{1}'' des Parameters {0} muss gr\u00f6\u00dfer-gleich null sein.
PARAMETER_NOT_UNIQUE_IN_NATIVE_SCHEMA=CDIST1517E Parametername {0} wird in der nativen Schemadatei mehrmals verwendet.
PARAMS_NOT_ALLOWED_WHEN_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1518E Parameter 'reconnectionPolicy', 'reconnectionBound', 'period', 'maxMessageSendRetries' und 'messageSendRetryDelay' k\u00f6nnen nicht angegeben werden, wenn JMSSink an einer konsistenten Region mitwirkt.
PROPERTY_NOT_FOUND_IN_APP_CONFIG=CDIST1519E Eigenschaft {0} wurde in der Anwendungskonfigurationsdatei {1} nicht gefunden.
PROVIDER_URL_MUST_BE_SPECIFIED_IN_CONN_DOC=CDIST1541E F\u00fcr das Attribut provider_url muss im Verbindungsdokument ein Wert angegeben werden.
REC_BOUND_NEG=CDIST1437E Der Wert des Parameters reconnectionBound muss gr\u00f6\u00dfer-gleich null sein.
REC_BOUND_NOT_ALLOWED=CDIST1436E reconnectionBound wird nur angezeigt, wenn der Parameter reconnectionPolicy auf BoundedRetry gesetzt ist.
RECONNECTION_EXCEPTION=CDIST1443E W\u00e4hrend der Verbindungswiederholung ist ein Fehler aufgetreten. Fehler: {0}
RECONNECTIONBOUND_CAN_APPEAR_ONLY_WHEN_RECONNECTIONPOLICY_IS_BOUNDEDRETRY=CDIST1542E reconnectionBound {0} kann nur verwendet werden, wenn der Parameter reconnectionPolicy auf BoundedRetry gesetzt ist 
RESET_CHECKPOINT=Zur\u00fccksetzung auf Pr\u00fcfpunkt {0} 
RESET_TO_INITIAL_STATE=Zur\u00fccksetzung auf Anfangsstatus...
RETIRE_CHECKPOINT=Pr\u00fcfpunkt {0} au\u00dfer Kraft setzen
STATEHANDLER_CLOSE=StateHandler Close
TRIGGERCOUNT_PARAM_MUST_BE_SET_WHEN_CONSISTENT_REGION_IS_OPERATOR_DRIVEN=CDIST1543E Der Parameter triggerCount muss gesetzt werden, wenn die konsistente Region als operatorgesteuert konfiguriert ist
TRIGGERCOUNT_VALUE_SHOULD_BE_GREATER_THAN_ZERO=CDIST1544E Der triggerCount-Wert {0} muss gr\u00f6\u00dfer als null sein  
UNSUPPORTED_MSG_CLASSES_FOR_JMSSOURCE=CDIST1545E Nachrichtenklassen xml, wbe und wbe22 werden f\u00fcr JMSSource nicht unterst\u00fctzt.
USER_CREDENTIALS_UPDATED=CDIST1546I Benutzerberechtigungsnachweise wurden aktualisiert
USERPRINCIPAL_AND_USERCREDENTIAL_MUST_BE_SET=CDIST1547E Nur einer der beiden Parameter userPrinicpal und userCredential ist gesetzt.
VALUE_OF_ACCESS_PARAM_NOT_FOUND_IN_CONN_DOC=CDIST1548E Der Wert des Zugriffsparameters {0} wurde im Verbindungsdokument nicht gefunden
VALUE_OF_CONNECTION_PARAM_NOT_FOUND_IN_CONN_DOC=CDIST1549E Der Wert des Verbindungsparameters {0} wurde im Verbindungsdokument nicht gefunden.
VALUE_OF_CONNECTION_PARAM_NOT_THE_SAME_AS_CONN_USED_BY_ACCESS_ELEMENT=CDIST1428E Der Wert des Verbindungsparameters {0} stimmt nicht mit der Verbindung \u00fcberein, die vom Zugriffselement {1} wie im Element uses_connection des Verbindungsdokuments aufgef\u00fchrt verwendet wird.
