# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.messaging.jms.JMSMessages.properties      CDIST1500 - CDIST1549
#
# IMPORTANT:
# Update this number if you add a new message, this is the next
# error number to use for new error messages:
# Next error number:  CDIST????

ATLEAST_ONE_ATTR=CDIST1431E La porta di output di errore facoltativa deve avere almeno un attributo.
ATMOST_TWO_ATTR=CDIST1430E La porta di output di errore facoltativa non pu\u00f2 avere pi\u00f9 di due attributi.
ATTEMPT_TO_RECONNECT=CDIST1527I Tentativo di ricreare la connessione
ATTEMPT_TO_RESEND_MESSAGE=CDIST1540I Tentativo di inviare di nuovo il messaggio ({0}).
ATTRIB_IN_SPL_SCHEMA_MUST_BE_RSTRING_USTRING_OR_XML=CDIST1476E {0} nello schema spl deve essere di tipo rstring, ustring o xml.
ATTRIB_TYPE_FOR_STREAM_ATTRIB_NOT_SUPPORTED_SPL_TYPE=CDIST1477E Il tipo attributo: {0} per l''attributo stream: {1} non \u00e8 un tipo SPL supportato.
ATTRIB_WITH_TYPE_IN_NATIVE_SCHEMA_CANNOT_BE_MAPPED_TO_ATTRIB_WITH_TYPE=CDIST1478E Il nome attributo: {0} con tipo: {1} nello schema nativo non pu\u00f2 essere mappato con l''attributo: {2} con tipo: {3}. 
ATTRIB_WITH_TYPE_IN_NATIVE_SCHEMA_NOT_FOUND_IN_STREAM_SCHEMA=CDIST1479E Il nome attributo: {0} con tipo: {1} nello schema nativo non \u00e8 stato trovato nello schema del flusso.
ATTRIB_WITH_TYPE_IS_INVALID_MUST_BE_STRING=CDIST1480E Il nome attributo: {0} con tipo: {1} non \u00e8 valido. L''attributo deve essere di tipo String.
BLOB_NOT_SUPPORTED_FOR_JMSSOURCE=CDIST1481E BLOB non \u00e8 un tipo SPL supportato per l'adattatore JMSSource.
BLOB_NOT_SUPPORTED_FOR_MSG_CLASS=CDIST1482E Il tipo di dati Blob non \u00e8 supportato per la classe di messaggi {0}.
CHECKPOINT=Punto di controllo {0}...
CHECKPOINT_CANNOT_PROCEED_MISSING_CHECKPOINT_MSG=CDIST1483E Impossibile continuare il punto di controllo, previsto un messaggio del punto di controllo, ma non trovato.
CODEPAGE_APPEARS_ONLY_WHEN_MSG_CLASS_IS_BYTES=CDIST1484E codepage \u00e8 presente solo quando la classe di messaggi \u00e8 bytes.
CONNECTION_TO_JMS_FAILED_DID_NOT_TRY_RECONNECT=CDIST1485E Connessione a JMS non riuscita. Tentativo di riconnessione non eseguito perch\u00e9 la politica \u00e8 noReconnect
CONNECTION_TO_JMS_FAILED=CDIST1486E Connessione a JMS non riuscita: {0}
CONNECTION_TO_JMS_FAILED_INVALID_MSG_SELECTOR=CDIST1487E Connessione a JMS non riuscita. Selettore messaggi non valido.
CONNECTION_TO_JMS_FAILED_NO_RECONNECT_AS_RECONNECT_POLICY_DOES_NOT_APPLY=CDIST1488E Connessione a JMS non riuscita. Tentativo di riconnessione non eseguito perch\u00e9 la politica di riconnessione non \u00e8 applicabile qui.
CONNECTION_TO_JMS_FAILED_NUMBER_OF_TRIES_EXCEDED=CDIST1489E Connessione a JMS non riuscita. Il numero limite di tentativi \u00e8 stato superato
CONSISTENTREGIONQUEUENAME_CANNOT_BE_SPECIFIED_WHEN_NOT_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1490E Il parametro consistentRegionQueueName non pu\u00f2 essere specificato quando JMSSink non partecipa a una regione congruente
CONSISTENTREGIONQUEUENAME_MUST_BE_SET_WHEN_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1491E Il parametro consistentRegionQueueName deve essere impostato quando JMSSink partecipa a una regione congruente
CONSISTENTREGIONQUEUENAME_VALUE_MUST_BE_NON_EMPTY=CDIST1492E Il valore consistentRegionQueueName deve essere un valore non vuoto
DEDUPLICATE_MESSAGES=Deduplicazione dei messaggi...
DISCARD_MSG_TOO_SHORT=CDIST1470W Il messaggio \u00e8 troppo breve ed \u00e8 stato ignorato.
DISCARD_WRONG_MESSAGE_TYPE=CDIST1471W Il messaggio viene ignorato perch\u00e9 il tipo di messaggio non \u00e8 corretto. Il tipo previsto \u00e8:  messaggio {0}.
DISCARD_MSG_UNREADABLE=CDIST1474W \u00c8 stato effettuato un tentativo di leggere un messaggio di sola scrittura, e il messaggio \u00e8 stato ignorato.
DISCARD_MESSAGE_MESSAGE_FORMAT_ERROR=CDIST1475W La conversione di tipo non era valida. Quindi il messaggio \u00e8 stato ignorato.
DISCARD_MESSAGE_MESSAGE_VARIABLE=CDIST1379W Il messaggio \u00e8 stato ignorato per il seguente motivo: {0} 
DISCARD_TRANSACTION_AS_IT_HAS_BEEN_PROCESSED_LAST_TIME=CDIST1493I Ignorare questa transazione perch\u00e9 \u00e8 stata elaborata l'ultima volta.
DRAIN=Svuotamento...
ERROR_DURING_RECEIVE=CDIST1472W Si \u00e8 verificato un errore durante la chiamata di ricezione del messaggio del consumer {0}
ERROR_DURING_SEND=CDIST1473W Si \u00e8 verificato un errore durante la chiamata di invio del messaggio dal producer {0}
ERROR_PORT_ATTR_COUNT_MAX=CDIST1441E La porta di output di errore facoltativa pu\u00f2 avere solo un attributo.
ERROR_PORT_ATTR_TYPE=CDIST1442E L'attributo nella porta di output di errore facoltativa deve essere un rstring.
ERROR_PORT_FIRST_ATTR_RSTRING=CDIST1433E Il primo attributo nella porta di output di errore facoltativa deve essere un rstring.
ERROR_PORT_FIRST_ATTR_TUPLE=CDIST1434E Il primo attributo nella porta di output di errore facoltativa deve essere una tupla.
ERROR_PORT_SECOND_ATTR_RSTRING=CDIST1439E Il secondo attributo nella porta di output di errore facoltativa deve essere un rstring.
EXCEPTION_SINK=CDIST1440E Questa tupla viene eliminata perch\u00e9 si \u00e8 verificata un'eccezione durante l'invio.
FIRST_ATTR_RSTRING=CDIST1432E Quando viene specificato solo l'attributo obbligatorio, il primo attributo deve essere un rstring.
IGNORED_DUPLICATED_MSG=CDIST1494I Messaggio duplicato ignorato: {0}
INIT_DELAY_NEG=CDIST1438E Il valore del parametro initDelay deve essere maggiore o uguale a zero.
INV_VALUE_REC_POLICY=CDIST1435E Il valore del parametro reconnectionPolicy deve essere uno tra InfiniteRetry, NoRetry e BoundedRetry.
INVALID_PROVIDER_URL=CDIST1495E Rilevato valore provider_url non valido: {0}
LENGTH_ATTRIB_CAN_BE_NONNEG-2-4_ONLY_FOR_MSG_CLASS_BYTES_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1496E L''attributo lenght pu\u00f2 essere non negativo, -2 o -4 solo per la classe di messaggi Bytes per il parametro: {0} nel file di schema nativo.
LENGTH_ATTRIB_SHOULD_BE_NONNEG-2-4_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1497E L''attributo lenght deve essere non negativo, -2 o -4 per il parametro: {0} nel file di schema nativo.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_IN_NATIVE_SCHEMA=CDIST1498E L''attributo lenght non deve essere presente per il parametro: {0} nel file di schema nativo.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_IN_NATIVE_SCHEMA_FOR_MSG_CLASS_BYTES=CDIST1499E L''attributo lenght deve essere presente per il parametro: {0} nel file di schema nativo per la classe di messaggi Bytes.
LENGTH_ATTRIB_SHOULD_NOT_BE_PRESENT_FOR_PARAM_WITH_TYPE_IN_NATIVE_SCHEMA=CDIST1510E L''attributo lenght non deve essere presente per il parametro: {0} con tipo {1} nel file di schema nativo.
MESSAGE_RESEND_NEG=CDIST1429E Il valore del parametro {0} non pu\u00f2 essere negativo.
NATIVE_SCHEMA_CANNOT_BE_SPECIFIED_WITH_MSG_CLASS_EMPTY=CDIST1511E Lo schema nativo non pu\u00f2 essere specificato con classe di messaggi Empty.
NATIVE_SCHEMA_CANNOT_CONTAIN_MORE_THAN_ONE_ATTRIB_WITH_MSG_CLASS_TXT=CDIST1512E Lo schema nativo non pu\u00f2 contenere pi\u00f9 di un attributo con classe di messaggi Text.
NATIVE_SCHEMA_MUST_BE_SPECIFIED_FOR_MESSAGE_CLASS=CDIST1513E Lo schema nativo deve essere specificato per la classe di messaggi {0}.
NO_VALID_MSG_CLASS_SPECIFIED=CDIST1514E Nessuna classe di messaggi valida specificata.
OP_CANNOT_BE_START_OF_CONSISTENT_REGION=CDIST1515E Il seguente operatore non pu\u00f2 essere l''inizio di una regione congruente: {0}.
PARAM_VALUE_SHOULD_BE_GREATER_OR_EQUAL_TO_ZERO=CDIST1516E Il valore ''{1}'' del parametro {0} deve essere maggiore o uguale a zero.
PARAMETER_NOT_UNIQUE_IN_NATIVE_SCHEMA=CDIST1517E Il nome parametro  {0} appare pi\u00f9 di una volta nel file di schema nativo.
PARAMS_NOT_ALLOWED_WHEN_PARTICIPATING_IN_CONSISTENT_REGION=CDIST1518E I parametri 'reconnectionPolicy', 'reconnectionBound', 'period', 'maxMessageSendRetries' e 'messageSendRetryDelay' non possono essere specificati quando JMSSink partecipa a una regione congruente
PROPERTY_NOT_FOUND_IN_APP_CONFIG=CDIST1519E La propriet\u00e0 {0} non \u00e8 stata trovata nella configurazione dell''applicazione {1}.
PROVIDER_URL_MUST_BE_SPECIFIED_IN_CONN_DOC=CDIST1541E \u00c8 necessario specificare un valore per l'attributo provider_url nel documento di connessione.
REC_BOUND_NEG=CDIST1437E Il valore del parametro reconnectionBound deve essere maggiore o uguale a zero.
REC_BOUND_NOT_ALLOWED=CDIST1436E reconnectionBound \u00e8 presente solo quando il parametro reconnectionPolicy \u00e8 impostato su BoundedRetry.
RECONNECTION_EXCEPTION=CDIST1443E Si \u00e8 verificato un errore durante la riconnessione. L''errore \u00e8 {0}
RECONNECTIONBOUND_CAN_APPEAR_ONLY_WHEN_RECONNECTIONPOLICY_IS_BOUNDEDRETRY=CDIST1542E reconnectionBound {0} pu\u00f2 essere presente solo quando il parametro reconnectionPolicy \u00e8 impostato su BoundedRetry e non pu\u00f2 essere presente negli altri casi 
RESET_CHECKPOINT=Reimpostato al punto di controllo {0} 
RESET_TO_INITIAL_STATE=Reimpostazione allo stato iniziale...
RETIRE_CHECKPOINT=Disattivazione punto di controllo {0}
STATEHANDLER_CLOSE=Chiusura StateHandler
TRIGGERCOUNT_PARAM_MUST_BE_SET_WHEN_CONSISTENT_REGION_IS_OPERATOR_DRIVEN=CDIST1543E Il parametro triggerCount deve essere impostato quando la regione congruente \u00e8 configurata come basata su operatore
TRIGGERCOUNT_VALUE_SHOULD_BE_GREATER_THAN_ZERO=CDIST1544E Il valore di triggerCount {0} deve essere maggiore di zero  
UNSUPPORTED_MSG_CLASSES_FOR_JMSSOURCE=CDIST1545E Le classi di messaggi xml, wbe e wbe22 non sono supportate per JMSSource.
USER_CREDENTIALS_UPDATED=CDIST1546I Le credenziali utente sono state aggiornate
USERPRINCIPAL_AND_USERCREDENTIAL_MUST_BE_SET=CDIST1547E Viene impostato solo uno tra userPrinicpal e userCredential.
VALUE_OF_ACCESS_PARAM_NOT_FOUND_IN_CONN_DOC=CDIST1548E Il valore del parametro di accesso {0} non \u00e8 stato trovato nel documento delle connessioni
VALUE_OF_CONNECTION_PARAM_NOT_FOUND_IN_CONN_DOC=CDIST1549E Il valore del parametro di connessione {0} non \u00e8 stato trovato nel documento delle connessioni.
VALUE_OF_CONNECTION_PARAM_NOT_THE_SAME_AS_CONN_USED_BY_ACCESS_ELEMENT=CDIST1428E Il valore del parametro di connessione {0}  non \u00e8 lo stesso della connessione utilizzata dall''elemento di accesso {1} come menzionato nell''elemento uses_connection nel documento di connessioni.
