###############################################################################
# Copyright (C) 2014, International Business Machines Corporation
# All Rights Reserved
###############################################################################
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

INVALID_CONNECTION_DOC=CDIST155OE Ung\u00fcltiges Verbindungsdokument.
NUMBER_OF_TOPICS_MUST_EQUAL_QOS_ENTRIES=CDIST1551E Anzahl der Themen (Topics) muss mit der Anzahl der QoS-Eintr\u00e4ge \u00fcbereinstimmen.
UNABLE_TO_CONNECT_TO_SERVER=CDIST1569E Verbindung zum Server kann nicht hergestellt werden.
UNABLE_TO_CONNECT_TO_SERVER_CLIENT_WRAPPER=CDIST1552E [Verbinden:] Verbindung zum Server kann nicht hergestellt werden.
UNABLE_TO_CONNECT_TO_SERVER_WITH_URI=CDIST1553E Verbindung zum Server kann nicht hergestellt werden: {0}
UNABLE_TO_PUBLISH_MSG=CDIST1554E Nachricht kann nicht publiziert werden
TOPIC_OR_QOS_INVALID=CDIST1555E Thema (Topic) oder QoS nicht g\u00fcltig. Nachricht kann nicht publiziert werden.  Thema: {0} QoS: {1}
CANNOT_PROCESS_CTRL_SIGNAL=CDIST1556E Steuersignal kann nicht verarbeitet werden: {0}
DATA_ATTRIB_NOT_FOUND_FROM_INPUT_PORT=CDIST1565E Datenattribut ('data') in Eingabeport 0 des Datenstromschemas nicht gefunden. Ein g\u00fcltiges Datenattribut kann \u00fcber eine der folgenden Methoden angegeben werden: Geben Sie den Namen f\u00fcr das Datenattribut \u00fcber das Operatorattribut 'dataAttributeName' an oder weisen Sie einem der Attribute im Datenstromschema den Namen 'data' zu. Wenn das Schema nur ein Attribut enth\u00e4lt, wird diesesautomatisch als Datenattribut aufgefasst, sofern es den Typ 'rstring' oder 'blob' hat.
DATA_ATTRIB_NOT_FOUND_FROM_OUTPUT_PORT=CDIST1564E Datenattribut ('data') in Ausgabeport 0 des Datenstromschemas nicht gefunden. Ein g\u00fcltiges Datenattribut kann \u00fcber eine der folgenden Methoden angegeben werden: Geben Sie den Namen des Datenattributs \u00fcber das Operatorattribut 'dataAttributeName' an oder weisen Sie einem der Attribute im Datenstromschema den Namen 'data' zu. Wenn das Schema nur ein Attribut enth\u00e4lt, wird dieses automatisch als Datenattribut aufgefasst, sofern es den Typ 'rstring' oder 'blob' hat.
TOPIC_OR_TOPICATTRIB_MUST_BE_SPECIFIED=CDIST1557E Mindestens eins der folgenden Attribute muss angegeben werden: 'topic', 'topicAttributeName'.
TIMED_OUT_WAITING_FOR_TUPLES_DRAINING=CDIST1578E Beim Warten auf das Ende der Tupelbereinigung wurde das Zeitlimit \u00fcberschritten.
SIGNAL_CONTAINS_INVALID_QOS=CDIST1572E Steuersignal enth\u00e4lt ung\u00fcltiges QoS. Das Signal wird ignoriert. Themen: {0}, QoS: {1}
MGTT_CLIENT_ERROR_WHILE_HANDLING_MQTT_CLIENT_REQ=CDIST1574E [Anforderungswarteschlange:] MQTT-Clientfehler beim Bearbeiten der MQTT-Clientanforderung: {0}
RUNTIME_EXCEPTION_WHILE_HANDLING_MQTT_CLIENT_REQ=CDIST1575E [Anforderungswarteschlange:] Laufzeitausnahmebedingung beim Bearbeiten von MQTT-Clientanforderungen: {0}
URI_SYNTAX_EXCEPTION=CDIST1576E [Anforderungswarteschlange:] URI-Syntaxausnahmebedingung: {0}
IGNORED_EMPTY_ERVER_URI_FROM_CTRL_SIGNAL=CDIST1570E Server-URI aus Steuersignal ist leer und wird daher ignoriert.
NUMBER_OF_TOPICS_MUST_EQUAL_QOS_VALUES=CDIST1563E Anzahl der Themen stimmt nicht mit der Anzahl der QoS-Werte \u00fcberein.
OUTPUT_PORT_EXPECTED_TO_HAVE_SINGLE_ATTRIB=CDIST1566E Es wird erwartet, dass Ausgabeport 1 ein einziges Attribut des Typs 'rstring' oder 'ustring' hat.
CANNOT_FIND_CONNECTION_IN_CONNECTION_DOC=CDIST1558E Verbindung aus Verbindungsdokument kann nicht gefunden werden.  Server-URI kann nicht initialisiert werden.
CONNECTION_DOC_MALFORMED=CDIST1559E Verbindungsdokument ist fehlerhaft.
CANNOT_FIND_CONNECTION_IN_CONNECTION_DOC_WITH_NAME=CDIST1560E Verbindung aus Verbindungsdokument kann nicht gefunden werden: {0} 
NOT_IN_RANGE=CDIST1561E {0} liegt nicht im Bereich zwischen {1} und {2}.
NOT_A_NUMBER=CDIST1562E {0} ist keine Zahl.
CANNOT_SUBMIT_ERROR_TUPLE=CDIST1567E Fehlertupel kann nicht \u00fcbergeben werden.
SERVER_URI_OR_CONNECTION_MUST_BE_SET=CDIST1568E 'serverUri' oder 'connection' muss festgelegt werden.
PARAM_MUST_BE_NON_EMPTY_STRING=CDIST1577E {0} muss eine nicht leere Zeichenfolge sein.
PROPERTY_NOT_FOUND_IN_APP_CONFIG=CDIST1579E Eigenschaft {0} wurde in Anwendungskonfiguration {1} nicht gefunden.
CTRL_SIGNAL_CONTAINS_EMPTY_TOPIC=CDIST1573W Steuersignal enth\u00e4lt ein leeres Thema. Das Thema wird ignoriert.
SERVER_URI_FROM_SIGNAL_IGNORED_AS_ALREADY_CONNECTED=CDIST1571W Server-URI aus Steuersignal wird ignoriert, da der Operator MqttSource bereits mit dem angegebenen Server verbunden ist.
TIMED_OUT_WAITING_FOR_SERVER_RESPONSE=CDIST1580W Beim Warten auf eine Antwort vom Server wurde das Zeitlimit \u00fcberschritten.
OP_CANNOT_BE_START_OF_CONSISTENT_REGION=CDIST1581E Der folgende Operator darf nicht der Anfang einer konsistenten Region sein: {0}.
CTRL_PORT_IN_CONSISTENT_REGION_NOT_SUPPORTED=CDIST1582W Ein Steuerport in einer konsistenten Region wird nicht unterst\u00fctzt. Die Steuerinformationen werden m\u00f6glicherweise nicht ordnungsgem\u00e4\u00df wiedergegeben, auf Platte gespeichert oder wiederhergestellt.  Sie m\u00fcssen die Steuersignale m\u00f6glicherweise manuell wiedergeben, um den Operator wieder in einen konsistenten Status zu versetzen.
OP_CANNOT_PARTICIPATE_IN_CONSISTENT_REGION=CDIST1583E Der folgende Operator darf sich nicht in einer konsistenten Region befinden: {0}.
