###############################################################################
# Copyright (C) 2014, International Business Machines Corporation
# All Rights Reserved
###############################################################################
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

INVALID_CONNECTION_DOC=CDIST1550E Documento de conexi\u00f3n no v\u00e1lido.
NUMBER_OF_TOPICS_MUST_EQUAL_QOS_ENTRIES=CDIST1551E El n\u00famero de temas debe ser igual al n\u00famero de entradas qos.
UNABLE_TO_CONNECT_TO_SERVER=CDIST1569E No se ha podido conectar con el servidor.
UNABLE_TO_CONNECT_TO_SERVER_CLIENT_WRAPPER=CDIST1552E [Connect:] No se ha podido conectar con el servidor.
UNABLE_TO_CONNECT_TO_SERVER_WITH_URI=CDIST1553E No se ha podido conectar con el servidor: {0}
UNABLE_TO_PUBLISH_MSG=CDIST1554E No se ha podido publicar el mensaje
TOPIC_OR_QOS_INVALID=CDIST1555E Tema o Qos no v\u00e1lido, no se ha podido publicar el mensaje. Tema: {0} Qos: {1}
CANNOT_PROCESS_CTRL_SIGNAL=CDIST1556E No se ha podido procesar la se\u00f1al de control: {0}
DATA_ATTRIB_NOT_FOUND_FROM_INPUT_PORT=CDIST1565E No se ha encontrado el atributo data del puerto de entrada 0 en el esquema de corriente, se debe especificar un atributo data v\u00e1lido con uno de los m\u00e9todos siguientes: indicar el nombre de atributo data mediante el atributo de operador 'dataAttributeName', nombrar uno de los atributos de esquema de corriente como 'data'; en el caso en que el esquema contenga s\u00f3lo un \u00fanico atributo, se considerar\u00e1 autom\u00e1ticamente el atributo data si su tipo es rstring o blob.
DATA_ATTRIB_NOT_FOUND_FROM_OUTPUT_PORT=CDIST1564E No se ha encontrado el atributo data del puerto de salida 0 en el esquema de corriente, se debe especificar un atributo data v\u00e1lido con uno de los m\u00e9todos siguientes: indicar el nombre de atributo data mediante el atributo de operador 'dataAttributeName', nombrar uno de los atributos de esquema de corriente como 'data'; en el caso en que el esquema contenga s\u00f3lo un \u00fanico atributo, se considerar\u00e1 autom\u00e1ticamente el atributo data si su tipo es rstring o blob.
TOPIC_OR_TOPICATTRIB_MUST_BE_SPECIFIED=CDIST1557E Se debe especificar al menos uno de los atributos siguientes: 'topic', 'topicAttributeName'.
TIMED_OUT_WAITING_FOR_TUPLES_DRAINING=CDIST1578E Se ha excedido el tiempo de espera mientras se esperaba que las tuplas finalizaran el drenaje.
SIGNAL_CONTAINS_INVALID_QOS=CDIST1572E La se\u00f1al de control contiene qos no v\u00e1lido, la se\u00f1al se ignora. Temas: {0}, Qos: {1}
MGTT_CLIENT_ERROR_WHILE_HANDLING_MQTT_CLIENT_REQ=CDIST1574E [Cola de solicitudes:] Error de cliente MQTT mientras se manejaba la solicitud de cliente MQTT: {0}
RUNTIME_EXCEPTION_WHILE_HANDLING_MQTT_CLIENT_REQ=CDIST1575E [Cola de solicitudes:] Se ha producido una excepci\u00f3n de tiempo de ejecuci\u00f3n mientras se manejaban solicitudes de cliente MQTT: {0}
URI_SYNTAX_EXCEPTION=CDIST1576E [Cola de solicitudes:] Excepci\u00f3n de sintaxis de URI: {0}
IGNORED_EMPTY_ERVER_URI_FROM_CTRL_SIGNAL=CDIST1570E Se ha ignorado el URI de servidor de la se\u00f1al de control porque est\u00e1 vac\u00edo.
NUMBER_OF_TOPICS_MUST_EQUAL_QOS_VALUES=CDIST1563E El n\u00famero de temas no coincide con el n\u00famero de valores de qos.
OUTPUT_PORT_EXPECTED_TO_HAVE_SINGLE_ATTRIB=CDIST1566E Se espera que el puerto de salida 1 tenga un \u00fanico atributo de tipo rstring o ustring.
CANNOT_FIND_CONNECTION_IN_CONNECTION_DOC=CDIST1558E No se ha podido encontrar la conexi\u00f3n en el documento de conexi\u00f3n.  No se ha podido inicializar serverUri.
CONNECTION_DOC_MALFORMED=CDIST1559E El documento de conexi\u00f3n est\u00e1 incorrectamente formado.
CANNOT_FIND_CONNECTION_IN_CONNECTION_DOC_WITH_NAME=CDIST1560E No se ha podido encontrar la conexi\u00f3n en el documento de conexi\u00f3n: {0} 
NOT_IN_RANGE=CDIST1561E {0} no est\u00e1 en el rango de {1} y {2}.
NOT_A_NUMBER=CDIST1562E {0} no es un n\u00famero.
CANNOT_SUBMIT_ERROR_TUPLE=CDIST1567E No se ha podido enviar tupla de error.
SERVER_URI_OR_CONNECTION_MUST_BE_SET=CDIST1568E Se debe establecer 'serverUri' o 'connection'.
PARAM_MUST_BE_NON_EMPTY_STRING=CDIST1577E {0} debe ser una serie no vac\u00eda.
PROPERTY_NOT_FOUND_IN_APP_CONFIG=CDIST1579E No se ha encontrado la propiedad {0} en la configuraci\u00f3n de la aplicaci\u00f3n {1}.
CTRL_SIGNAL_CONTAINS_EMPTY_TOPIC=CDIST1573W La se\u00f1al de control contiene un tema vac\u00edo, el tema se ignorar\u00e1.
SERVER_URI_FROM_SIGNAL_IGNORED_AS_ALREADY_CONNECTED=CDIST1571W El URI de servidor de la se\u00f1al de control se ha ignorado porque el operador MqttSource ya est\u00e1 conectado al servidor especificado.
TIMED_OUT_WAITING_FOR_SERVER_RESPONSE=CDIST1580W Se ha excedido el tiempo de espera mientras se esperaba una respuesta del servidor.
OP_CANNOT_BE_START_OF_CONSISTENT_REGION=CDIST1581E El operador siguiente no puede ser el inicio de una regi\u00f3n coherente: {0}.
CTRL_PORT_IN_CONSISTENT_REGION_NOT_SUPPORTED=CDIST1582W Tener un puerto de control en una regi\u00f3n coherente no est\u00e1 soportado. La informaci\u00f3n de control no puede ser reproducida, hacer persistente y restaurada correctamente.  Puede ser necesario reproducir manualmente las se\u00f1ales de control para devolver el operador a un estado coherente.
OP_CANNOT_PARTICIPATE_IN_CONSISTENT_REGION=CDIST1583E El operador siguiente no puede estar en una regi\u00f3n coherente: {0}.
