###############################################################################
# Copyright (C) 2014, International Business Machines Corporation
# All Rights Reserved
###############################################################################
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

INVALID_CONNECTION_DOC=CDIST155OE Documento de conex\u00e3o inv\u00e1lido.
NUMBER_OF_TOPICS_MUST_EQUAL_QOS_ENTRIES=CDIST1551E O n\u00famero de t\u00f3picos deve ser igual ao n\u00famero de entradas qos.
UNABLE_TO_CONNECT_TO_SERVER=CDIST1569E N\u00e3o \u00e9 poss\u00edvel se conectar ao servidor.
UNABLE_TO_CONNECT_TO_SERVER_CLIENT_WRAPPER=CDIST1552E [Connect:] N\u00e3o \u00e9 poss\u00edvel se conectar ao servidor.
UNABLE_TO_CONNECT_TO_SERVER_WITH_URI=CDIST1553E N\u00e3o \u00e9 poss\u00edvel se conectar ao servidor: {0}
UNABLE_TO_PUBLISH_MSG=CDIST1554E N\u00e3o \u00e9 poss\u00edvel publicar mensagem
TOPIC_OR_QOS_INVALID=CDIST1555E T\u00f3pico ou Qos inv\u00e1lido, n\u00e3o \u00e9 poss\u00edvel publicar a mensagem. T\u00f3pico: {0} Qos: {1}
CANNOT_PROCESS_CTRL_SIGNAL=CDIST1556E N\u00e3o \u00e9 poss\u00edvel processar o sinal de controle: {0}
DATA_ATTRIB_NOT_FOUND_FROM_INPUT_PORT=CDIST1565E O atributo de dados n\u00e3o foi localizado na porta de entrada 0 no esquema de fluxo, pode ser especificado um atributo de dados v\u00e1lido com um dos seguintes m\u00e9todos: indique o nome do atributo de dados por meio do atributo do operador 'dataAttributeName', nomeie um dos atributos de esquema de fluxo como 'data', caso o esquema contenha somente um \u00fanico atributo, ele ser\u00e1 considerado automaticamente o atributo de dados, se seu tipo for rstring ou blob.
DATA_ATTRIB_NOT_FOUND_FROM_OUTPUT_PORT=CDIST1564E O atributo de dados n\u00e3o foi localizado na porta de sa\u00edda 0 no esquema de fluxo, pode ser especificado um atributo de dados v\u00e1lido com um dos seguintes m\u00e9todos: indique o nome do atributo de dados por meio do atributo do operador 'dataAttributeName', nomeie um dos atributos de esquema de fluxo como 'data', caso o esquema contenha somente um \u00fanico atributo, ele ser\u00e1 considerado automaticamente o atributo de dados, se seu tipo for rstring ou blob.
TOPIC_OR_TOPICATTRIB_MUST_BE_SPECIFIED=CDIST1557E Pelo menos um dos seguintes atributos deve ser especificado: 'topic', 'topicAttributeName'.
TIMED_OUT_WAITING_FOR_TUPLES_DRAINING=CDIST1578E Atingido o tempo limite ao esperar as tuplas conclu\u00edrem a drenagem.
SIGNAL_CONTAINS_INVALID_QOS=CDIST1572E O sinal de controle cont\u00e9m um qos inv\u00e1lido, o sinal ser\u00e1 ignorado. T\u00f3picos: {0}, Qos: {1}
MGTT_CLIENT_ERROR_WHILE_HANDLING_MQTT_CLIENT_REQ=CDIST1574E [Request Queue:] Erro do MQTT Client ao manipular solicita\u00e7\u00e3o do MQTT Client: {0}
RUNTIME_EXCEPTION_WHILE_HANDLING_MQTT_CLIENT_REQ=CDIST1575E [Request Queue:] Ocorreu uma exce\u00e7\u00e3o de tempo de execu\u00e7\u00e3o ao manipular solicita\u00e7\u00f5es do MQTT Client: {0}
URI_SYNTAX_EXCEPTION=CDIST1576E [Request Queue:] Exce\u00e7\u00e3o de sintaxe do URI: {0}
IGNORED_EMPTY_ERVER_URI_FROM_CTRL_SIGNAL=CDIST1570E URI do servidor do sinal de controle ignorado porque est\u00e1 vazio.
NUMBER_OF_TOPICS_MUST_EQUAL_QOS_VALUES=CDIST1563E O n\u00famero de t\u00f3picos n\u00e3o corresponde ao n\u00famero de valores qos.
OUTPUT_PORT_EXPECTED_TO_HAVE_SINGLE_ATTRIB=CDIST1566E \u00c9 esperado que a porta de sa\u00edda 1 tenha um \u00fanico atributo do tipo rstring ou ustring.
CANNOT_FIND_CONNECTION_IN_CONNECTION_DOC=CDIST1558E N\u00e3o \u00e9 poss\u00edvel localizar a conex\u00e3o no documento de conex\u00e3o. N\u00e3o \u00e9 poss\u00edvel inicializar serverUri.
CONNECTION_DOC_MALFORMED=CDIST1559E O documento de conex\u00e3o est\u00e1 malformado.
CANNOT_FIND_CONNECTION_IN_CONNECTION_DOC_WITH_NAME=CDIST1560E N\u00e3o \u00e9 poss\u00edvel localizar a conex\u00e3o no documento de conex\u00e3o: {0} 
NOT_IN_RANGE=CDIST1561E {0} n\u00e3o est\u00e1 dentro do intervalo de {1} e {2}.
NOT_A_NUMBER=CDIST1562E {0} n\u00e3o \u00e9 um n\u00famero.
CANNOT_SUBMIT_ERROR_TUPLE=CDIST1567E N\u00e3o \u00e9 poss\u00edvel enviar a tupla de erro.
SERVER_URI_OR_CONNECTION_MUST_BE_SET=CDIST1568E Um de 'serverUri' ou 'connection' deve ser configurado.
PARAM_MUST_BE_NON_EMPTY_STRING=CDIST1577E {0} deve ser uma sequ\u00eancia de caracteres n\u00e3o vazia.
PROPERTY_NOT_FOUND_IN_APP_CONFIG=CDIST1579E A propriedade {0} n\u00e3o foi localizada na configura\u00e7\u00e3o de aplicativo {1}.
CTRL_SIGNAL_CONTAINS_EMPTY_TOPIC=CDIST1573W O sinal de controle cont\u00e9m um t\u00f3pico vazio, o t\u00f3pico ser\u00e1 ignorado.
SERVER_URI_FROM_SIGNAL_IGNORED_AS_ALREADY_CONNECTED=CDIST1571W O URI do servidor do sinal de controle foi ignorado porque o operador MqttSource j\u00e1 est\u00e1 conectado ao servidor especificado.
TIMED_OUT_WAITING_FOR_SERVER_RESPONSE=CDIST1580W Atingido o tempo limite ao esperar uma resposta do servidor.
OP_CANNOT_BE_START_OF_CONSISTENT_REGION=CDIST1581E O seguinte operador n\u00e3o pode ser o in\u00edcio de uma regi\u00e3o consistente: {0}.
CTRL_PORT_IN_CONSISTENT_REGION_NOT_SUPPORTED=CDIST1582W N\u00e3o \u00e9 suportado ter uma porta de controle em uma regi\u00e3o consistente. As informa\u00e7\u00f5es de controle n\u00e3o podem ser reproduzidas, persistidas e restauradas corretamente.  Pode ser necess\u00e1rio reproduzir manualmente os sinais de controle para trazer o operador de volta para um estado consistente.
OP_CANNOT_PARTICIPATE_IN_CONSISTENT_REGION=CDIST1583E O seguinte operador n\u00e3o pode estar em uma regi\u00e3o consistente: {0}.
