###############################################################################
# Copyright (C) 2014, International Business Machines Corporation
# All Rights Reserved
###############################################################################
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

INVALID_CONNECTION_DOC=CDIST155OE Document de connexion non valide.
NUMBER_OF_TOPICS_MUST_EQUAL_QOS_ENTRIES=CDIST1551E Le nombre de rubriques doit \u00eatre \u00e9gal au nombre d'entr\u00e9es QOS.
UNABLE_TO_CONNECT_TO_SERVER=CDIST1569E Impossible de se connecter au serveur.
UNABLE_TO_CONNECT_TO_SERVER_CLIENT_WRAPPER=CDIST1552E [Connexion :] Impossible de se connecter au serveur.
UNABLE_TO_CONNECT_TO_SERVER_WITH_URI=CDIST1553E Impossible de se connecter au serveur : {0}
UNABLE_TO_PUBLISH_MSG=CDIST1554E Impossible de publier le message
TOPIC_OR_QOS_INVALID=CDIST1555E Rubrique ou QOS non valide ; impossible de publier le message.  Rubrique : {0} QOS : {1}
CANNOT_PROCESS_CTRL_SIGNAL=CDIST1556E Impossible de traiter le signal de contr\u00f4le : {0}
DATA_ATTRIB_NOT_FOUND_FROM_INPUT_PORT=CDIST1565E L'attribut de donn\u00e9es est introuvable \u00e0 partir du port d'entr\u00e9e 0 dans le sch\u00e9ma de flux. Un attribut de donn\u00e9es valide peut \u00eatre sp\u00e9cifi\u00e9 \u00e0 l'aide de l'une des m\u00e9thodes suivantes : indiquez le nom de l'attribut de donn\u00e9es via l'attribut d'op\u00e9rateur 'dataAttributeName' ou nommez l'un des attributs du sch\u00e9ma de flux 'data'. Si le sch\u00e9ma ne contient qu'un seul attribut, il est automatiquement consid\u00e9r\u00e9 comme un attribut de donn\u00e9es si son type est rstring ou blob.
DATA_ATTRIB_NOT_FOUND_FROM_OUTPUT_PORT=CDIST1564E L'attribut de donn\u00e9es est introuvable \u00e0 partir du port de sortie 0 dans le sch\u00e9ma de flux. Un attribut de donn\u00e9es valide peut \u00eatre sp\u00e9cifi\u00e9 \u00e0 l'aide de l'une des m\u00e9thodes suivantes : indiquez le nom de l'attribut de donn\u00e9es via l'attribut d'op\u00e9rateur 'dataAttributeName' ou nommez l'un des attributs du sch\u00e9ma de flux 'data'. Si le sch\u00e9ma ne contient qu'un seul attribut, il est automatiquement consid\u00e9r\u00e9 comme un attribut de donn\u00e9es si son type est rstring ou blob.
TOPIC_OR_TOPICATTRIB_MUST_BE_SPECIFIED=CDIST1557E Au moins l'un des attributs suivants doit \u00eatre sp\u00e9cifi\u00e9 : 'topic', 'topicAttributeName'.
TIMED_OUT_WAITING_FOR_TUPLES_DRAINING=CDIST1578E Expiration du d\u00e9lai d'attente de la fin de la vidange des blocs de donn\u00e9es.
SIGNAL_CONTAINS_INVALID_QOS=CDIST1572E Le signal de contr\u00f4le contenant un QOS incorrect, le signal est ignor\u00e9. Rubriques : {0} QOS : {1}
MGTT_CLIENT_ERROR_WHILE_HANDLING_MQTT_CLIENT_REQ=CDIST1574E [File d''attente des demandes :] Erreur du client MQTT lors du traitement de la demande du client MQTT : {0}
RUNTIME_EXCEPTION_WHILE_HANDLING_MQTT_CLIENT_REQ=CDIST1575E [File d''attente des demandes :] Une exception d''ex\u00e9cution s''est produite lors du traitement des demandes du client MQTT : {0}
URI_SYNTAX_EXCEPTION=CDIST1576E [File d''attente des demandes :] Exception de syntaxe URI : {0}
IGNORED_EMPTY_ERVER_URI_FROM_CTRL_SIGNAL=CDIST1570E L'URI du serveur provenant du signal de contr\u00f4le est ignor\u00e9 car il est vide.
NUMBER_OF_TOPICS_MUST_EQUAL_QOS_VALUES=CDIST1563E Le nombre de rubriques ne correspond pas au nombre de valeurs QOS.
OUTPUT_PORT_EXPECTED_TO_HAVE_SINGLE_ATTRIB=CDIST1566E Le port de sortie 1 doit avoir un seul attribut de type rstring ou ustring.
CANNOT_FIND_CONNECTION_IN_CONNECTION_DOC=CDIST1558E Connexion introuvable \u00e0 partir du document de connexion.  Impossible d'initialiser serverUri.
CONNECTION_DOC_MALFORMED=CDIST1559E Le document de connexion est incorrectement form\u00e9.
CANNOT_FIND_CONNECTION_IN_CONNECTION_DOC_WITH_NAME=CDIST1560E Connexion introuvable \u00e0 partir du document de connexion : {0} 
NOT_IN_RANGE=CDIST1561E {0} n''est pas compris dans la plage de {1} et {2}.
NOT_A_NUMBER=CDIST1562E {0} n''est pas un nombre.
CANNOT_SUBMIT_ERROR_TUPLE=CDIST1567E Impossible de soumettre le bloc de donn\u00e9es erron\u00e9.
SERVER_URI_OR_CONNECTION_MUST_BE_SET=CDIST1568E L'un des param\u00e8tres 'serverUri' ou 'connection' doit \u00eatre d\u00e9fini.
PARAM_MUST_BE_NON_EMPTY_STRING=CDIST1577E {0} doit \u00eatre une cha\u00eene non vide.
PROPERTY_NOT_FOUND_IN_APP_CONFIG=CDIST1579E Propri\u00e9t\u00e9 {0} introuvable dans la configuration d''application {1}.
CTRL_SIGNAL_CONTAINS_EMPTY_TOPIC=CDIST1573W Le signal de contr\u00f4le contient une rubrique vide, qui sera ignor\u00e9e.
SERVER_URI_FROM_SIGNAL_IGNORED_AS_ALREADY_CONNECTED=CDIST1571W L'URI de serveur provenant du signal de contr\u00f4le est ignor\u00e9 car l'op\u00e9rateur MqttSource est d\u00e9j\u00e0 connect\u00e9 au serveur indiqu\u00e9.
TIMED_OUT_WAITING_FOR_SERVER_RESPONSE=CDIST1580W Expiration du d\u00e9lai d'attente d'une r\u00e9ponse en provenance du serveur.
OP_CANNOT_BE_START_OF_CONSISTENT_REGION=CDIST1581E L''op\u00e9rateur suivant ne peut pas \u00eatre au d\u00e9but d''une r\u00e9gion coh\u00e9rente : {0}.
CTRL_PORT_IN_CONSISTENT_REGION_NOT_SUPPORTED=CDIST1582W L'existence d'un port de contr\u00f4le dans une r\u00e9gion coh\u00e9rente n'est pas prise en charge. Les informations de contr\u00f4le risquent de ne pas \u00eatre r\u00e9ex\u00e9cut\u00e9es, conserv\u00e9es ou restaur\u00e9es correctement.  Vous devrez peut-\u00eatre r\u00e9ex\u00e9cuter manuellement les signaux de contr\u00f4le pour que l'op\u00e9rateur repasse \u00e0 un \u00e9tat coh\u00e9rent.
OP_CANNOT_PARTICIPATE_IN_CONSISTENT_REGION=CDIST1583E L''op\u00e9rateur suivant ne peut pas se trouver dans une r\u00e9gion coh\u00e9rente : {0}.
