# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.messaging.kafka.KafkaMessages.properties      CDIST1360 - CDIST1384
#

ATTRIBUTE_MESSAGE_OR_MESSAGEATTRIBUTE_REQUIRED=CDIST1360E Le message appel\u00e9 par l'attribut ou d\u00e9crit par le param\u00e8tre ""messageAttribute"" est OBLIGATOIRE.
ATTRIBUTE_MUST_BE_ONE_OF=CDIST1361E L''attribut ""{0}"" doit \u00eatre l''un des suivants : {1}
ATTRIBUTE_NOT_AVAILABLE=CDIST1362E Attribut ""{0}"" non disponible.
ATTRIBUTE_NOT_FOUND=CDIST1363E Attribut introuvable pour ""{0}"".
CANNOT_BE_START_OF_CONSISTENT_REGION=CDIST1364E L''op\u00e9rateur {0} ne peut pas \u00eatre plac\u00e9 au d\u00e9but d''une r\u00e9gion coh\u00e9rente.
ERROR_WHILE_ACQUIRING_PERMIT=CDIST1365E Erreur lors de l''acquisition de l''autorisation : {0}
ERROR_WHILE_PROCESSING_AND_SUBMITTING_MESSAGES=CDIST1366E Erreur lors du traitement et de l''envoi des messages : {0}
KAFKA_CONNECTION_PROPERTIES_MUST_BE_SPECIFIED=CDIST1367E Les propri\u00e9t\u00e9s de connexion Kafka doivent \u00eatre sp\u00e9cifi\u00e9es.
KEY_AND_MESSAGE_MUST_HAVE_COMPATIBLE_TYPES=CDIST1368E Les types des attributs Key et Message doivent \u00eatre compatibles.
KEY_AND_MESSAGE_TYPE_MUST_MATCH_AND_BE_STRING_OR_BYTE=CDIST1369E Les types des attributs Key et Message doivent correspondre et \u00eatre String ou Byte.
MISSING_PRPERTIES=CDIST1370E Propri\u00e9t\u00e9s manquantes : v\u00e9rifiez que le param\u00e8tre appConfig, propertiesFile ou kafkaProperty est sp\u00e9cifi\u00e9. Vous devez en d\u00e9finir au moins un.
MISSING_REQUIRED_BOOTSTRAP_SERVERS_PROPS=CDIST1371E Il manque des propri\u00e9t\u00e9s bootstrap.servers obligatoires.
NUMBER_OF_THREADS_CANNOT_BE_LESS_THAN_ONE=CDIST1372E Le nombre d''unit\u00e9s d''ex\u00e9cution par rubrique ne peut pas \u00eatre inf\u00e9rieur \u00e0 1 : {0}
ONLY_ONE_TOPIC_CAN_BE_SPECIFIED_WHEN_PARTITION_PARAM_OIS_SET=CDIST1373E Param\u00e8tre de rubrique non valide : une seule rubrique peut \u00eatre sp\u00e9cifi\u00e9e lorsque le param\u00e8tre de partition est d\u00e9fini.
PARTITION_PARAM_MUST_BE_SPECIFIED_IN_CONSISTENT_REGION=CDIST1374E Le param\u00e8tre de partition doit \u00eatre sp\u00e9cifi\u00e9 dans les r\u00e9gions coh\u00e9rentes.
PROPERTY_NOT_FOUND_IN_APP_CONFIG=CDIST1375E Propri\u00e9t\u00e9 {0} introuvable dans la configuration d''application {1}.
PROPERTY_NOT_IN_KEY_VALUE_FORMAT=CDIST1376E Propri\u00e9t\u00e9 non valide : {0}, n''est pas au format key=value
SPECIFIED_DESERIALIZER_NOT_SUPPORTED=CDIST1377E Le convertisseur s\u00e9rie-parall\u00e8le indiqu\u00e9 n'est pas pris en charge par KafkaSource.
TOPIC_NOT_SPECIFIED=CDIST1378E Rubrique non sp\u00e9cifi\u00e9e. Indiquez les param\u00e8tres ""topicAttribute"" ou ""topic"".
