Repository: IBMStreams/streamsx.messaging
Catalog: com.ibm.streamsx.messaging/impl/*/*/MessagingResource.xlf
Languages: de_de, es_es, it_it, ja_jp, ko_kr

# CDIST1400E
source: A value for the InitialContext was not specified.
de_de: Für InitialContext wurde kein Wert angegeben.
es_es: No se ha especificado ningún valor para InitialContext.
it_it: Un valore per InitialContext non è stato specificato.
ja_jp: InitialContext の値が指定されませんでした。
ko_kr: InitialContext 값이 지정되지 않았습니다.

# CDIST1401E
source: The system cannot look up the Connection Factory.
de_de: Das System kann das Verbindungsfactory nicht suchen.
es_es: El sistema no puede buscar la fábrica de conexiones.
it_it: Il sistema non può ricercare nel factory di connessione.
ja_jp: システムは接続ファクトリーを検索できません。
ko_kr: 시스템이 연결 팩토리를 검색할 수 없습니다.

# CDIST1402E
source: The system cannot look up the Destination.
de_de: Das System kann das Ziel nicht suchen.
es_es: El sistema no puede buscar el destino.
it_it: Il sistema non può ricercare nella destinazione.
ja_jp: システムは宛先を検索できません。
ko_kr: 시스템이 대상을 검색할 수 없습니다.

# CDIST1403E
source: The system cannot look up the Connection Factory or the Destination.
de_de: Das System kann das Verbindungsfactory oder das Ziel nicht suchen.
es_es: El sistema no puede buscar la fábrica de conexiones o el destino.
it_it: Il sistema non può ricercare nel factory di connessione o nella destinazione.
ja_jp: システムは接続ファクトリーも宛先も検索できません。
ko_kr: 시스템이 연결 팩토리 또는 대상을 검색할 수 없습니다.

# CDIST1404E
source: The InitialContext cannot be created. The exception is: {0}.
de_de: Der Ausgangskontext (InitialContext) kann nicht erstellt werden. Ausnahmebedingung: {0}.
es_es: No se puede crear InitialContext. La excepción es: {0}.
it_it: Impossibile creare InitialContext. L''eccezione è: {0}.
ja_jp: InitialContext を作成できません。例外: {0}。
ko_kr: InitialContext를 작성할 수 없습니다. 예외는 {0}입니다.

# CDIST1405E
source: Exception occurred during the creation of the administered objects.
de_de: Beim Erstellen der verwalteten Objekte ist eine Ausnahmebedingung aufgetreten.
es_es: Se ha producido una excepción durante la creación de los objetos administrados.
it_it: Si è verificata un''eccezione durante la creazione degli oggetti amministrati.
ja_jp: 管理対象オブジェクトの作成中に例外が発生しました。
ko_kr: 관리 오브젝트 작성 중에 예외가 발생했습니다.

# CDIST1406E
source: The connection to the IBM Message Service Client failed. The NoRetry value of the reConnection Policy mandates that a reconnection is not allowed.
de_de: Die Verbindung zu IBM Message Service Client ist fehlgeschlagen. Der Wert NoRetry der Richtlinie reConnection gibt an, dass eine Verbindungswiederholung nicht zulässig ist.
es_es: La conexión a IBM Message Service Client ha fallado. El valor NoRetry de la política reConnection obliga a que no se permita la reconexión.
it_it: La connessione a IBM Message Service Client non è riuscita. Il valore NoRetry della politica reConnection indica che una riconnessione non è consentita.
ja_jp: IBM Message Service Client への接続に失敗しました。reConnection ポリシーの NoRetry 値は、再接続が許可されないよう指示します。
ko_kr: IBM Message Service Client에 대한 연결이 실패했습니다. reConnection 정책의 NoRetry 값을 사용하면 다시 연결이 허용되지 않습니다.

# CDIST1407E
source: The delivery mode cannot be set. The exception is: {0}.
de_de: Der Übermittlungsmodus kann nicht festgelegt werden. Ausnahmebedingung: {0}.
es_es: No se puede establecer la modalidad de suministro. La excepción es: {0}.
it_it: Impossibile impostare la modalità di consegna. L''eccezione è: {0}.
ja_jp: 送達モードを設定できません。例外: {0}。
ko_kr: 배달/전달 모드를 설정할 수 없습니다. 예외는 {0}입니다.

# CDIST1408E
source: The Producer cannot be created. The exception is: {0}.
de_de: Der Producer kann nicht erstellt werden. Ausnahmebedingung: {0}.
es_es: No se puede crear el productor. La excepción es: {0}.
it_it: Impossibile creare il producer. L''eccezione è: {0}.
ja_jp: プロデューサーを作成できません。例外: {0}。
ko_kr: 생성자를 작성할 수 없습니다. 예외는 {0}입니다.

# CDIST1409E
source: The Consumer cannot be created. The exception is: {0}.
de_de: Der Konsument kann nicht erstellt werden. Ausnahmebedingung: {0}.
es_es: No se puede crear el consumidor. La excepción es: {0}.
it_it: Impossibile creare il consumer. L''eccezione è: {0}.
ja_jp: コンシューマーを作成できません。例外: {0}。
ko_kr: 이용자를 작성할 수 없습니다. 예외는 {0}입니다.

# CDIST1410E
source: The Destination cannot be created. The exception is: {0}.
de_de: Das Ziel kann nicht erstellt werden. Ausnahmebedingung: {0}.
es_es: No se puede crear el destino. La excepción es: {0}.
it_it: Impossibile creare la destinazione. L''eccezione è: {0}.
ja_jp: 宛先を作成できません。例外: {0}。
ko_kr: 대상을 작성할 수 없습니다. 예외는 {0}입니다.

# CDIST1411E
source: The Session cannot be created. The exception is: {0}.
de_de: Die Sitzung kann nicht erstellt werden. Ausnahmebedingung: {0}.
es_es: No se puede crear la sesión. La excepción es: {0}.
it_it: Impossibile creare la sessione. L''eccezione è: {0}.
ja_jp: セッションを作成できません。例外: {0}。
ko_kr: 세션을 작성할 수 없습니다. 예외는 {0}입니다.

# CDIST1412E
source: An exception occurred during the creation of the IBM Message Service Client Application Programming Interface Objects. The exception is: {0}.
de_de: Beim Erstellen der Objekte von IBM Message Service Client Application Programming Interface ist eine Ausnahmebedingung aufgetreten. Ausnahmebedingung: {0}.
es_es: Se ha producido una excepción durante la creación de los objetos de interfaz de programación de aplicaciones de IBM Message Service Client. La excepción es: {0}.
it_it: Si è verificata un''eccezione durante la creazione degli oggetti API (Application Programming Interface) di IBM Message Service Client. L''eccezione è: {0}.
ja_jp: IBM Message Service Client アプリケーション・プログラミング・インターフェース・オブジェクトの作成中に例外が発生しました。例外: {0}。
ko_kr: IBM Message Service Client API(Application Programming Interface) 오브젝트 작성 중에 예외가 발생했습니다. 예외는 {0}입니다.

# CDIST1413E
source: An unknown exception occurred during the creation of the IBM Message Service Client Application Programming Interface Objects.
de_de: Beim Erstellen der Objekte von IBM Message Service Client Application Programming Interface ist eine unbekannte Ausnahmebedingung aufgetreten.
es_es: Se ha producido una excepción desconocida durante la creación de los objetos de interfaz de programación de aplicaciones de IBM Message Service Client.
it_it: Si è verificata un''eccezione sconosciuta durante la creazione degli oggetti API (Application Programming Interface) di IBM Message Service Client.
ja_jp: IBM Message Service Client アプリケーション・プログラミング・インターフェース・オブジェクトの作成中に不明な例外が発生しました。
ko_kr: IBM Message Service Client API(Application Programming Interface) 오브젝트 작성 중에 알 수 없는 예외가 발생했습니다.

# CDIST1414E
source: The Connection cannot be created. The exception is: {0}.
de_de: Die Verbindung kann nicht erstellt werden. Ausnahmebedingung: {0}.
es_es: No se puede crear la conexión. La excepción es: {0}.
it_it: Impossibile creare la connessione. L''eccezione è: {0}.
ja_jp: 接続を作成できません。例外: {0}。
ko_kr: 연결을 작성할 수 없습니다. 예외는 {0}입니다.

# CDIST1416E
source: The system cannot proceed because of the previous errors.
de_de: Das System kann aufgrund der vorherigen Fehler nicht fortgesetzt werden.
es_es: El sistema no puede continuar debido a errores anteriores.
it_it: Il sistema non può continuare a causa di precedenti errori.
ja_jp: 以前のエラーが理由でシステムは続行できません。
ko_kr: 이전 오류로 인해 시스템을 진행할 수 없습니다.

# CDIST1417E
source: The message was dropped because the system was not connected to the IBM Message Service Client.
de_de: Die Nachricht wurde gelöscht, da das System nicht mit IBM Message Service Client verbunden war.
es_es: El mensaje se ha descartado porque el sistema no estaba conectado a IBM Message Service Client.
it_it: Il messaggio è stato eliminato perché il sistema non era connesso a IBM Message Service Client.
ja_jp: システムが IBM Message Service Client に接続されていなかったため、メッセージは除去されました。
ko_kr: 시스템이 IBM Message Service Client에 연결되어 있지 않으므로 메시지가 삭제(drop)되었습니다.

# CDIST1418E
source: An exception occurred while the system was sending the message. The exception is: {0}. The error code is: {1}.
de_de: Eine Ausnahmebedingung ist aufgetreten, während das System die Nachricht gesendet hat. Ausnahmebedingung: {0}. Fehlercode: {1}.
es_es: Se ha producido una excepción mientras el sistema estaba enviando el mensaje. La excepción es: {0}. El código de error es: {1}.
it_it: Si è verificata un''eccezione mentre il sistema stava inviando il messaggio. L''eccezione è: {0}. Il codice di errore è: {1}.
ja_jp: システムがメッセージを送信中に例外が発生しました。例外: {0}。エラー・コードは {1} です。
ko_kr: 시스템이 메시지를 보내는 중에 예외가 발생했습니다. 예외는 {0}입니다. 오류 코드는 {1}입니다.

# CDIST1419E
source: An InfoSphere Streams exception occurred while the system was sending the message. The exception is: {0}. The explanation is: {1}.
de_de: Eine InfoSphere Streams-Ausnahmebedingung ist aufgetreten, während das System die Nachricht gesendet hat. Ausnahmebedingung: {0}. Erläuterung: {1}.
es_es: Se ha producido una excepción de InfoSphere Streams mientras el sistema estaba enviando el mensaje. La excepción es: {0}. La explicación es: {1}.
it_it: Si è verificata un''eccezione InfoSphere Streams mentre il sistema stava inviando il messaggio. L''eccezione è: {0}. La spiegazione è: {1}.
ja_jp: システムがメッセージを送信中に InfoSphere Streams 例外が発生しました。例外: {0}。説明: {1}。
ko_kr: 시스템이 메시지를 보내는 중에 InfoSphere Streams 예외가 발생했습니다. 예외는 {0}입니다. 설명은 {1}입니다.

# CDIST1420E
source: Other exception occurred while the system was sending the message. The exception is: {0}.
de_de: Eine andere Ausnahmebedingung ist aufgetreten, während das System die Nachricht gesendet hat. Ausnahmebedingung: {0}.
es_es: Se ha producido otra excepción mientras el sistema estaba enviando el mensaje. La excepción es: {0}.
it_it: Si è verificata un''altra eccezione mentre il sistema stava inviando il messaggio. L''eccezione è: {0}.
ja_jp: システムがメッセージを送信中にその他の例外が発生しました。例外: {0}。
ko_kr: 시스템이 메시지를 보내는 중에 다른 예외가 발생했습니다. 예외는 {0}입니다.

# CDIST1421E
source: An unknown exception occurred while the system was sending the message.
de_de: Eine unbekannte Ausnahmebedingung ist aufgetreten, während das System die Nachricht gesendet hat.
es_es: Se ha producido una excepción desconocida mientras el sistema estaba enviando el mensaje.
it_it: Si è verificata un''eccezione sconosciuta mentre il sistema stava inviando il messaggio.
ja_jp: システムがメッセージを送信中に不明な例外が発生しました。
ko_kr: 시스템이 메시지를 보내는 중에 알 수 없는 예외가 발생했습니다.

# CDIST1422E
source: The message listener with ID cannot be started. The exception is: {0}.
de_de: Der Nachrichtenlistener mit der ID kann nicht gestartet werden. Ausnahmebedingung: {0}.
es_es: No se puede iniciar el escucha de mensajes con ID. La excepción es: {0}.
it_it: Impossibile avviare il listener dei messaggi con ID. L''eccezione è: {0}.
ja_jp: ID を持つメッセージ・リスナーを開始できません。例外: {0}。
ko_kr: ID가 있는 메시지 리스너를 시작할 수 없습니다. 예외는 {0}입니다.

# CDIST1423E
source: The incoming message cannot be processed. The exception is: {0}.
de_de: Die ankommende Nachricht kann nicht verarbeitet werden. Ausnahmebedingung: {0}.
es_es: No se puede procesar el mensaje entrante. La excepción es: {0}.
it_it: Impossibile elaborare il messaggio in entrata. L''eccezione è: {0}.
ja_jp: 着信メッセージを処理できません。例外: {0}。
ko_kr: 수신 메시지를 처리할 수 없습니다. 예외는 {0}입니다.

# CDIST1424E
source: Text messages are not supported. The access specification cannot be used: {0}.
de_de: Textnachrichten werden nicht unterstützt. Die Zugriffsspezifikation kann nicht verwendet werden: {0}.
es_es: No se da soporte a mensajes de texto. No se puede utilizar la especificación de acceso: {0}.
it_it: I messaggi di testo non sono supportati. Impossibile utilizzare la specifica di accesso: {0}.
ja_jp: テキスト・メッセージはサポートされていません。アクセス仕様を使用できません: {0}。
ko_kr: 텍스트 메시지가 지원되지 않습니다. 액세스 스펙을 사용할 수 없음: {0}.

# CDIST1425E
source: Object messages are not supported. The access specification cannot be used: {0}.
de_de: Objektnachrichten werden nicht unterstützt. Die Zugriffsspezifikation kann nicht verwendet werden: {0}.
es_es: No se da soporte a mensajes de objeto. No se puede utilizar la especificación de acceso: {0}.
it_it: I messaggi oggetto non sono supportati. Impossibile utilizzare la specifica di accesso: {0}.
ja_jp: オブジェクト・メッセージはサポートされていません。アクセス仕様を使用できません: {0}。
ko_kr: 오브젝트 메시지가 지원되지 않습니다. 액세스 스펙을 사용할 수 없음: {0}.

# CDIST1460W
source: The message has the wrong type and is being discarded. The expected message type was {0}, but the a {1} message was received.
de_de: Die Nachricht hat den falschen Typ und wird verworfen. Der Nachrichtentyp {0} wurde erwartet, aber es wurde eine Nachricht des Typs {1} empfangen.
es_es: El mensaje tiene el tipo incorrecto y se está descartando. El tipo de mensaje esperado era {0}, pero se ha recibido un mensaje {1}.
it_it: Il messaggio ha il tipo errato e viene ignorato. Il tipo di messaggio previsto era {0}, ma è stato ricevuto un messaggio {1}.
ja_jp: メッセージは、誤ったタイプのため破棄されます。予期されたメッセージ・タイプは {0} でしたが、{1} メッセージを受け取りました。
ko_kr: 메시지의 유형이 잘못되어서 메시지를 버리는 중입니다. 예상 메시지 유형이 {0}이지만 {1} 메시지가 수신되었습니다.

# CDIST1461W
source: The message was discarded because the message length of {0} is not valid.
de_de: Die Nachricht wurde verworfen, da die Nachrichtenlänge {0} ungültig ist.
es_es: El mensaje se ha descartado porque la longitud del mensaje de {0} no es válida.
it_it: Il messaggio è stato ignorato perché la lunghezza del messaggio {0} non è valida.
ja_jp: メッセージ長 {0} は無効のため、メッセージは破棄されました。
ko_kr: {0}의 메시지 길이가 유효하지 않아 메시지를 버렸습니다.

# CDIST1462W
source: The message was discarded because the message is too short.
de_de: Die Nachricht wurde verworfen, da die Nachricht zu kurz ist.
es_es: El mensaje se ha descartado porque el mensaje es demasiado corto.
it_it: Il messaggio è stato ignorato perché il messaggio è troppo breve.
ja_jp: メッセージは、短すぎるため破棄されました。
ko_kr: 메시지가 너무 짧아 메시지를 버렸습니다.

# CDIST1463W
source: The message was discarded because the message does not contain a body. A {0} message was expected.
de_de: Die Nachricht wurde verworfen, da die Nachricht keinen Text enthält. Eine {0}-Nachricht wurde erwartet.
es_es: El mensaje se ha descartado porque el mensaje no contiene un cuerpo. Se esperaba un mensaje {0}.
it_it: Il messaggio è stato ignorato perché il messaggio non contiene un corpo. Era previsto un messaggio {0}.
ja_jp: メッセージは、本文を含まないため破棄されました。{0} メッセージが予期されました。
ko_kr: 메시지에 본문이 없어 메시지를 버렸습니다. {0} 메시지가 예상되었습니다.

# CDIST1464W
source: The message was discarded because the type is not recognized.
de_de: Die Nachricht wurde verworfen, da der Typ nicht erkannt wird.
es_es: El mensaje se ha descartado porque no se reconoce el tipo.
it_it: Il messaggio è stato ignorato perché il tipo non è stato riconosciuto.
ja_jp: タイプが認識されないため、メッセージは破棄されました。
ko_kr: 유형이 인식되지 않아 메시지를 버렸습니다.

# CDIST1465W
source: The message was discarded, because at least one attribute is missing: {0}
de_de: Die Nachricht wurde verworfen, da mindestens ein Attribut fehlt: {0}
es_es: El mensaje se ha descartado porque falta al menos un atributo: {0}
it_it: Il messaggio è stato ignorato, perché almeno un attributo è mancante: {0}
ja_jp: 少なくとも 1 つの属性が欠落しているため、メッセージは破棄されました: {0}
ko_kr: 하나 이상의 속성이 누락되어 메시지를 버렸습니다. {0}

# CDIST1520I
source: The system is about to connect to the IBM Message Service Client.
de_de: Das System ist im Begriff, die Verbindung zu IBM Message Service Client herzustellen.
es_es: El sistema está a punto de conectarse a IBM Message Service Client.
it_it: Il sistema sta per connettersi a IBM Message Service Client.
ja_jp: システムは、IBM Message Service Client に接続しようとしています。
ko_kr: 시스템이 IBM Message Service Client에 연결하려고 합니다.

# CDIST1521I
source: The connection to the IBM Message Service Client failed. The system is waiting for {0} seconds before it reconnects. The number of connection attempts is: {1}.
de_de: Die Verbindung zu IBM Message Service Client ist fehlgeschlagen. Das System wartet {0} Sekunden, bevor es erneut versucht, eine Verbindung herzustellen. Anzahl der Verbindungsversuche: {1}.
es_es: La conexión a IBM Message Service Client ha fallado. El sistema espera durante {0} segundos antes de reconectar. El número de intentos de conexión es: {1}.
it_it: La connessione a IBM Message Service Client non è riuscita. Il sistema attende {0} secondi prima di connettersi di nuovo. Il numero di tentativi di connessione è: {1}.
ja_jp: IBM Message Service Client への接続に失敗しました。システムは {0} 秒間待った後、再接続します。接続試行回数: {1}。
ko_kr: IBM Message Service Client에 대한 연결이 실패했습니다. 시스템이 다시 연결하기 전에 {0}초 동안 대기합니다. 연결 시도 수는 {1}입니다.

# CDIST1522I
source: The connection to the IBM Message Service Client failed. The system is waiting for {0} seconds before it reconnects.
de_de: Die Verbindung zu IBM Message Service Client ist fehlgeschlagen. Das System wartet {0} Sekunden, bevor es erneut versucht, eine Verbindung herzustellen.
es_es: La conexión a IBM Message Service Client ha fallado. El sistema espera durante {0} segundos antes de reconectar.
it_it: La connessione a IBM Message Service Client non è riuscita. Il sistema attende {0} secondi prima di connettersi di nuovo.
ja_jp: IBM Message Service Client への接続に失敗しました。システムは {0} 秒間待った後、再接続します。
ko_kr: IBM Message Service Client에 대한 연결이 실패했습니다. 시스템이 다시 연결하기 전에 {0}초 동안 대기합니다.

# CDIST1523I
source: The connection to the IBM Message Service Client succeeded.
de_de: Die Verbindung zu IBM Message Service Client wurde erfolgreich hergestellt.
es_es: La conexión a IBM Message Service Client se ha realizado correctamente.
it_it: La connessione a IBM Message Service Client è riuscita.
ja_jp: IBM Message Service Client への接続に成功しました。
ko_kr: IBM Message Service Client에 대한 연결이 성공했습니다.

# CDIST1524I
source: The tuple is being sent to the error output port.
de_de: Das Tupel wird an den Port für Fehlernachrichten gesendet.
es_es: La tupla se está enviando al puerto de salida de error.
it_it: La tupla viene inviata alla porta di output di errore.
ja_jp: タプルはエラー出力ポートに送信されます。
ko_kr: 오류 출력 포트로 튜플을 보내는 중입니다.

# CDIST1525I
source: The message was sent. The ID is: {0}.
de_de: Die Nachricht wurde gesendet. ID: {0}.
es_es: El mensaje se ha enviado. El ID es: {0}.
it_it: Il messaggio è stato inviato. L''ID è: {0}.
ja_jp: メッセージが送信されました。ID: {0}。
ko_kr: 메시지가 전송되었습니다. ID는 {0}입니다.

# CDIST1526I
source: The wait time before starting is {0} seconds.
de_de: Die Wartezeit vor dem Start beträgt {0} Sekunden.
es_es: El tiempo de espera antes del inicio es {0} segundos.
it_it: Il tempo di attesa prima dell''avvio è {0} secondi.
ja_jp: 開始前の待機時間は {0} 秒です。
ko_kr: 시작할 때까지의 대기 시간은 {0}초입니다.

# CDIST1426E
source: Incorrect number of arguments passed to Connection->new(). Required are type and name values. Optional is document.
de_de: Eine falsche Anzahl Argumente wurde an Connection->new() übergeben. Erforderlich sind Typ- und Namenswerte. Das Dokument ist optional.
es_es: Se ha pasado un número incorrecto de argumentos a Connection->new(). Son necesarios valores para el tipo y nombre. El documento es opcional.
it_it: Numero di argomenti errato passato a Connection->new(). I valori di tipo e nome sono obbligatori. Il documento è facoltativo.
ja_jp: 誤った数の引数が Connection->new() に渡されました。必須は、タイプと名前の値です。オプションは、文書です。
ko_kr: 올바르지 않은 수의 인수가 Connection->new()에 전달되었습니다. 필수 인수는 유형 및 이름 값입니다. 선택적 인수는 문서입니다.

# CDIST1427E
source: Connection XML document ''{0}'' does not exist.
de_de: XML-Dokument ''{0}'' für Verbindung ist nicht vorhanden.
es_es: El documento XML de conexión ''{0}'' no existe.
it_it: Il documento XML di connessione ''{0}'' non esiste.
ja_jp: 接続 XML 文書 ''{0}'' は存在しません。
ko_kr: 연결 XML 문서 ''{0}''이(가) 존재하지 않습니다.

# CDIST1584E
source: Connection XML document ''{0}'' is empty.
de_de: XML-Dokument ''{0}'' für Verbindung ist leer.
es_es: El documento XML de conexión ''{0}'' está vacío.
it_it: Il documento XML di connessione ''{0}'' è vuoto.
ja_jp: 接続 XML 文書 ''{0}'' は空です。
ko_kr: 연결 XML 문서 ''{0}''이(가) 비어 있습니다.

# CDIST1585E
source: Connection XML document ''{0}'' is not readable. Please, check permissions.
de_de: XML-Dokument ''{0}'' für Verbindung ist nicht lesbar. Prüfen Sie die Berechtigungen.
es_es: El documento XML de conexión ''{0}'' no se puede leer. Compruebe los permisos.
it_it: Il documento XML di connessione ''{0}'' non può essere letto. Controllare le autorizzazioni.
ja_jp: 接続 XML 文書 ''{0}'' は読み取り可能ではありません。権限を確認してください。
ko_kr: 연결 XML 문서 ''{0}''을(를) 읽을 수 없습니다. 권한을 확인하십시오.

# CDIST1586E
source: ''{0}'' is a directory, not a connection XML document.
de_de: ''{0}'' ist ein Verzeichnis, kein XML-Dokument für die Verbindung.
es_es: ''{0}'' es un directorio, no un documento XML de conexión.
it_it: ''{0}'' è una directory, non un documento XML di connessione.
ja_jp: ''{0}'' はディレクトリーであり、接続 XML 文書ではありません。
ko_kr: ''{0}''은(는) 연결 XML 문서가 아니라 디렉토리입니다.

# CDIST1587E
source: Connection XML document ''{0}'' is not a text file.
de_de: XML-Dokument ''{0}'' für die Verbindung ist keine Textdatei.
es_es: El documento XML de conexión ''{0}'' no es un archivo de texto.
it_it: Il documento XML di connessione ''{0}'' non è un file di testo.
ja_jp: 接続 XML 文書 ''{0}'' はテキスト・ファイルではありません。
ko_kr: 연결 XML 문서 ''{0}''이(가) 텍스트 파일이 아닙니다.

# CDIST1588E
source: Connection XML document ''{0}'' does not validate with schema ''{1}'' using the system command ''{2}''.
de_de: XML-Dokument ''{0}'' für die Verbindung validiert nicht mit dem Schema ''{1}'' unter Verwendung des Systembefehls ''{2}''.
es_es: El documento XML de conexión ''{0}'' no pasa la validación con el esquema ''{1}'' mediante el mandato del sistema ''{2}''.
it_it: Il documento XML di connessione ''{0}'' non è stato convalidato con lo schema ''{1}'' utilizzando il comando di sistema ''{2}''.
ja_jp: 接続 XML 文書 ''{0}'' は、システム・コマンド ''{2}'' を使用してスキーマ ''{1}'' で妥当性検査しません。
ko_kr: 연결 XML 문서 ''{0}''이(가) 시스템 명령 ''{2}''을(를) 사용하여 스키마 ''{1}''에 대해 유효성 검증되지 않습니다.

# CDIST1589E
source: Connection XML file problem. {0}
de_de: Problem in XML-Datei für die Verbindung. {0}
es_es: Problema con el archivo XML de conexión. {0}
it_it: Problema con il file XML di connessione. {0}
ja_jp: 接続 XML ファイルの問題。{0}
ko_kr: 연결 XML 파일 문제점입니다. {0}

# CDIST1590E
source: Missing access_specification named ''{0}'' in file ''{1}''.
de_de: Zugriffsspezifikation mit dem Namen ''{0}'' in Datei ''{1}'' fehlt.
es_es: Falta la especificación de acceso denominada ''{0}'' en el archivo ''{1}''.
it_it: access_specification denominata ''{0}'' mancante nel file ''{1}''.
ja_jp: ファイル ''{1}'' には、access_specification 名 ''{0}'' が欠落しています。
ko_kr: 파일 ''{1}''에서 access_specification ''{0}''이(가) 누락되었습니다.

# CDIST1591E
source: Missing ''{0}'' tag from access_specification ''{1}'' in file ''{2}''.
de_de: Tag ''{0}'' fehlt in Zugriffsspezifikation ''{1}'' in Datei ''{2}''.
es_es: Falta la etiqueta ''{0}'' en la especificación de acceso ''{1}'' en el archivo ''{2}''.
it_it: Tag ''{0}'' mancante da access_specification ''{1}'' nel file ''{2}''.
ja_jp: ファイル ''{2}'' の access_specification ''{1}'' から ''{0}'' タグが欠落しています。
ko_kr: 파일 ''{2}''의 access_specification ''{1}''에서 ''{0}'' 태그가 누락되었습니다.

# CDIST1592E
source: Incorrect number of arguments passed to Access->checkStaticParameterAt(). Required are index and check values. Optional is quiet mode.
de_de: Eine falsche Anzahl Argumente wurde an Access->checkStaticParameterAt() übergeben. Erforderlich sind Index- und Überprüfungswerte. Der Befehlszeilenmodus ist optional.
es_es: Se ha pasado un número incorrecto de argumentos a Access->checkStaticParameterAt(). Son necesarios valores para el índice y la comprobación. La modalidad silenciosa es opcional.
it_it: Numero di argomenti errato passato a Access->checkStaticParameterAt(). I valori di indice e controllo sono obbligatori. La modalità quiet è facoltativa.
ja_jp: 誤った数の引数が Access->checkStaticParameterAt() に渡されました。必須は、索引とチェックの値です。オプションは、抑止モードです。
ko_kr: 올바르지 않은 수의 인수가 Access->checkStaticParameterAt()에 전달되었습니다. 필수 인수는 인덱스 및 확인 값입니다. 선택적 인수는 자동 모드입니다.
