Repository: IBMStreams/streamsx.messaging
Catalog: com.ibm.streamsx.messaging/impl/*/*/MessagingResource.xlf
Languages: de_de, es_es, it_it, ja_jp, ko_kr

# CDIST1329E
source: Operator ''{0}'': native schema attribute {1} in access specification {2} cannot have Bytes data for this message class.
de_de: Operator ''{0}'': Das native Schemaattribut {1} in der Zugriffsspezifikation {2} darf für diese Nachrichtenklassen keine Bytedaten aufweisen.
es_es: Operador ''{0}'': el atributo de esquema nativo {1} en la especificación de acceso {2} no puede tener datos de bytes para esta clase de mensaje.
it_it: Operatore ''{0}'': l''attributo dello schema nativo {1} nella specifica di accesso {2} non può avere dati Bytes per questa classe di messaggi.
ja_jp: オペレーター ''{0}'': アクセス仕様 {2} のネイティブ・スキーマ属性 {1} は、このメッセージ・クラスの Bytes データを含むことはできません。
ko_kr: 연산자 ''{0}'': 이 메시지 클래스의 경우 액세스 스펙 {2}의 원시(native) 스키마 속성 {1}에 Bytes 데이터가 포함되면 안 됩니다.

# CDIST1330E
source: Operator ''{0}'': output stream attribute ''{1}'' has no matching attribute in the native schema in access specification {2}.
de_de: Operator ''{0}'': Ausgabedatenstromattribut ''{1}'' hat kein übereinstimmendes Attribut im nativen Schema in der Zugriffsspezifikation {2}.
es_es: Operador ''{0}'': el atributo de corriente de salida ''{1}'' no tiene ningún atributo coincidente en el esquema nativo en la especificación de acceso {2}.
it_it: Operatore ''{0}'': l''attributo del flusso di output ''{1}'' non ha alcun attributo corrispondente nello schema nativo nella specifica di accesso {2}.
ja_jp: オペレーター ''{0}'': 出力ストリーム属性 ''{1}'' には、アクセス仕様 {2} のネイティブ・スキーマに一致する属性がありません。
ko_kr: 연산자 ''{0}'': 액세스 스펙 {2}에서 출력 스트림 속성 ''{1}''이(가) 원시(native) 스키마의 속성과 일치하지 않습니다.

# CDIST1331E
source: Operator ''{0}'': native schema attribute ''{1}'' defined in access specification ''{2}'' must have a valid length specification.
de_de: Operator ''{0}'': Das in der Zugriffsspezifikation ''{2}'' definierte native Schemaattribut ''{1}'' muss eine gültige Längenspezifikation aufweisen.
es_es: Operador ''{0}'': el atributo de esquema nativo ''{1}'' definido en la especificación de acceso ''{2}'' debe tener una especificación de longitud válida.
it_it: Operatore ''{0}'': l''attributo dello schema nativo ''{1}'' definito nella specifica di accesso ''{2}'' deve avere una specifica di lunghezza valida.
ja_jp: オペレーター ''{0}'': アクセス仕様 ''{2}'' に定義されたネイティブ・スキーマ属性 ''{1}'' に有効な長さ指定が必要です。
ko_kr: 연산자 ''{0}'': 액세스 스펙 ''{2}''에 정의된 원시(native) 스키마 속성 ''{1}''에 유효한 길이 스펙이 포함되어야 합니다.

# CDIST1332E
source: The following operator cannot be in a consistent region: {0}
de_de: Der folgende Operator darf sich nicht in einer konsistenten Region befinden: {0}
es_es: El operador siguiente no puede estar en una región coherente: {0}
it_it: Il seguente operatore non può essere in una regione congruente: {0}
ja_jp: 次のオペレーターは整合領域に置くことはできません: {0}
ko_kr: {0} 연산자는 일관성 있는 영역에 있을 수 없습니다.

# CDIST1333E
source: A value must be specified for initial_context attribute in connection document.
de_de: Für das Attribut initial_context im Verbindungsdokument muss ein Wert angegeben werden.
es_es: Debe especificarse un valor para el atributo initial_context en el documento de conexión.
it_it: È necessario specificare un valore per l''attributo initial_context nel documento di connessione.
ja_jp: 接続文書に initial_context 属性の値を指定する必要があります。
ko_kr: 연결 문서의 initial_context 속성에 값을 지정해야 합니다.

# CDIST1334E
source: Invalid initial_context format detected.
de_de: Ungültiges initial_context-Format erkannt.
es_es: Se ha detectado un formato initial_context no válido.
it_it: Rilevato formato di initial_context non valido.
ja_jp: 無効な initial_context 形式が検出されました。
ko_kr: 유효하지 않은 initial_context 형식이 발견되었습니다.
