Repository: IBMStreams/streamsx.messaging
Catalog: com.ibm.streamsx.messaging/impl/*/*/MessagingResource.xlf
Languages: de_de, es_es, it_it, ja_jp, ko_kr

# CDIST1593E
source: Invalid parameter check. ''{0}'' is greater than the number of parameters for the access named ''{1}''
de_de: Ungültige Parameterprüfung. ''{0}'' ist größer als die Anzahl der Parameter für den Zugriff mit dem Namen ''{1}''.
es_es: Comprobación de parámetro no válido. ''{0}'' es mayor que el número de parámetros para el acceso denominado ''{1}''
it_it: Controllo parametro non valido. ''{0}'' è maggiore del numero di parametri per l''accesso denominato ''{1}''
ja_jp: 無効なパラメーター・チェック。''{0}'' は、アクセス指定 ''{1}'' のパラメーターの数より大きくなっています
ko_kr: 매개변수 확인이 유효하지 않습니다. ''{0}''이(가) 액세스 ''{1}''에 대한 매개변수 수보다 큽니다.

# CDIST1594E
source: Invalid constant value ''{0}'' for parameter ''{1}'' of access named ''{2}''. Valid values are: ''{3}''.
de_de: Ungültiger konstanter Wert ''{0}'' für Parameter ''{1}'' des Zugriffs mit dem Namen ''{2}''. Gültige Werte: ''{3}''.
es_es: Valor constante no válido ''{0}'' para el parámetro ''{1}'' del acceso denominado ''{2}''. Los valores válidos son: ''{3}''.
it_it: Valore della costante ''{0}'' non valido per il parametro ''{1}'' dell''accesso denominato ''{2}''. I valori validi sono: ''{3}''.
ja_jp: アクセス指定 ''{2}'' のパラメーター ''{1}'' の定数値 ''{0}'' が無効です。有効な値: ''{3}''。
ko_kr: 이름이 ''{2}''인 액세스의 매개변수 ''{1}''에 대한 상수 값 ''{0}''이(가) 유효하지 않습니다. 유효한 값은 ''{3}''입니다.

# CDIST1595E
source: Value of ''{0}'' for parameter ''{1}'' of access named ''{2}'' is over the maximum allowed of ''{3}''.
de_de: Der Wert ''{0}'' für Parameter ''{1}'' des Zugriffs mit dem Namen ''{2}'' liegt über dem zulässigen Höchstwert ''{3}''.
es_es: El valor ''{0}'' para el parámetro ''{1}'' del acceso denominado ''{2}'' es mayor que el valor máximo permitido ''{3}''.
it_it: Il valore ''{0}'' per il parametro ''{1}'' dell''accesso denominato ''{2}'' è superiore al massimo consentito ''{3}''.
ja_jp: アクセス指定 ''{2}'' のパラメーター ''{1}'' の値 ''{0}'' が、最大許容値の ''{3}'' を超えています。
ko_kr: 이름이 ''{2}''인 액세스의 매개변수 ''{1}''에 대한 값 ''{0}''이(가) 허용된 최대값 ''{3}''을(를) 초과합니다.

# CDIST1596E
source: Value of ''{0}'' for parameter ''{1}'' of access named ''{2}'' is under the minimum allowed of ''{3}''.
de_de: Der Wert ''{0}'' für Parameter ''{1}'' des Zugriffs mit dem Namen ''{2}'' liegt unter dem zulässigen Mindestwert ''{3}''.
es_es: El valor ''{0}'' para el parámetro ''{1}'' del acceso denominado ''{2}'' es menor que el valor mínimo permitido ''{3}''.
it_it: Il valore ''{0}'' per il parametro ''{1}'' dell''accesso denominato ''{2}'' è inferiore al minimo consentito ''{3}''.
ja_jp: アクセス指定 ''{2}'' のパラメーター ''{1}'' の値 ''{0}'' が、最小許容値の ''{3}'' を下回っています。
ko_kr: 이름이 ''{2}''인 액세스의 매개변수 ''{1}''에 대한 값 ''{0}''이(가) 허용된 최소값 ''{3}'' 미만입니다.

# CDIST1597E
source: Unsupported check type specified for parameter ''{0}'' of access named ''{1}''.
de_de: Für Parameter ''{0}'' des Zugriffs mit dem Namen ''{1}'' wurde ein nicht unterstützter Überprüfungstyp angegeben.
es_es: Tipo de comprobación no soportado para el parámetro ''{0}'' del acceso denominado ''{1}''.
it_it: Specificato un tipo di controllo non supportato per il parametro ''{0}'' dell''accesso denominato ''{1}''.
ja_jp: アクセス指定 ''{1}'' のパラメーター ''{0}'' に、サポートされないチェック・タイプが指定されました。
ko_kr: 이름이 ''{1}''인 액세스의 매개변수 ''{0}''에 대해 지원되지 않는 확인 유형이 지정되었습니다.

# CDIST1598E
source: Invalid parameter check. ''{0}'' is greater than the number of parameters for the access named ''{1}''.
de_de: Ungültige Parameterprüfung. ''{0}'' ist größer als die Anzahl der Parameter für den Zugriff mit dem Namen ''{1}''.
es_es: Comprobación de parámetro no válido. ''{0}'' es mayor que el número de parámetros para el acceso denominado ''{1}''.
it_it: Controllo parametro non valido. ''{0}'' è maggiore del numero di parametri per l''accesso denominato ''{1}''.
ja_jp: 無効なパラメーター・チェック。''{0}'' は、アクセス指定 ''{1}'' のパラメーターの数より大きくなっています。
ko_kr: 매개변수 확인이 유효하지 않습니다. ''{0}''이(가) 이름이 ''{1}''인 액세스의 매개변수 수보다 큽니다.

# CDIST1599E
source: Incorrect number of arguments passed to Connection->new(). Required are type and name values. Optional is document.
de_de: Eine falsche Anzahl Argumente wurde an Connection->new() übergeben. Erforderlich sind Typ- und Namenswerte. Das Dokument ist optional.
es_es: Se ha pasado un número incorrecto de argumentos a Connection->new(). Son necesarios valores para el tipo y nombre. El documento es opcional.
it_it: Numero di argomenti errato passato a Connection->new(). I valori di tipo e nome sono obbligatori. Il documento è facoltativo.
ja_jp: 誤った数の引数が Connection->new() に渡されました。必須は、タイプと名前の値です。オプションは、文書です。
ko_kr: 올바르지 않은 수의 인수가 Connection->new()에 전달되었습니다. 필수 인수는 유형 및 이름 값입니다. 선택적 인수는 문서입니다.

# CDIST1300E
source: Missing connection_specification named ''{0}'' in file ''{1}''.
de_de: Verbindungsspezifikation mit dem Namen ''{0}'' in Datei ''{1}'' fehlt.
es_es: Falta la especificación de conexión denominada ''{0}'' en el archivo ''{1}''.
it_it: connection_specification denominata ''{0}'' mancante nel file ''{1}''.
ja_jp: ファイル ''{1}'' には、connection_specification 名 ''{0}'' が欠落しています。
ko_kr: 파일 ''{1}''에서 connection_specification ''{0}''이(가) 누락되었습니다.

# CDIST1301E
source: Missing ''{0}'' element from connection_specification ''{1}'' in file ''{2}''.
de_de: Element ''{0}'' fehlt in Verbindungsspezifikation ''{1}'' in Datei ''{2}''.
es_es: Falta el elemento ''{0}'' en la especificación de conexión ''{1}'' en el archivo ''{2}''.
it_it: Elemento ''{0}'' mancante da connection_specification ''{1}'' nel file ''{2}''.
ja_jp: ファイル ''{2}'' の connection_specification ''{1}'' から ''{0}'' エレメントが欠落しています。
ko_kr: 파일 ''{2}''의 connection_specification ''{1}''에서 ''{0}'' 요소가 누락되었습니다.

# CDIST1302E
source: Value of parameter ''{0}'' has unexpected format: {1}.
de_de: Wert des Parameters ''{0}'' hat ein unerwartetes Format: {1}.
es_es: El valor del parámetro ''{0}'' tiene el formato inesperado: {1}.
it_it: Il valore del parametro ''{0}'' ha un formato non previsto: {1}.
ja_jp: パラメーター ''{0}'' の値が予期しないフォーマットです: {1}。
ko_kr: 매개변수 ''{0}''의 값 형식이 예기치 않은 형식입니다: {1}.

# CDIST1303E
source: ERROR: {0}
de_de: FEHLER: {0}
it_it: ERRORE: {0}
ja_jp: エラー: {0}
ko_kr: 오류: {0}

# CDIST1304E
source: ERROR: Connection specification {0} is not the name of a uses_connection element of access specification {1}.
de_de: FEHLER: Verbindungsspezifikation {0} ist nicht der Name eines Elements uses_connection der Zugriffsspezifikation {1}.
es_es: ERROR: La especificación de conexión {0} no es el nombre de un elemento uses_connection de la especificación de acceso {1}.
it_it: ERRORE: La specifica di connessione {0} non è il nome di un elemento uses_connection della specifica di accesso {1}.
ja_jp: エラー: 接続指定 {0} は、アクセス仕様 {1} の uses_connection エレメントの名前ではありません。
ko_kr: 오류: 연결 스펙 {0}이(가) 액세스 스펙 {1}의 uses_connection 요소의 이름이 아닙니다.

# CDIST1305E
source: ''{0}'': Invalid parameter specified for ''{1}'' operator, access specification ''{2}''.
de_de: ''{0}'': Ungültiger Parameter angegeben für Operator ''{1}'', Zugriffsspezifikation ''{2}''.
es_es: ''{0}'': Parámetro no válido especificado para el operador ''{1}'', especificación de acceso {2}''.
it_it: ''{0}'': Parametro non valido specificato per l''operatore ''{1}'', specifica di accesso ''{2}''.
ja_jp: ''{0}'': アクセス仕様 ''{2}'' で ''{1}'' オペレーターに指定されたパラメーターが無効です。
ko_kr: ''{0}'': ''{1}'' 연산자, 액세스 스펙 ''{2}''에 대해 유효하지 않은 매개변수가 지정되었습니다.

# CDIST1306E
source: ''{0}'': Parameter for access specification ''{1}'' previously defined (at index {2}).
de_de: ''{0}'': Parameter für Zugriffsspezifikation ''{1}'' wurde vorher definiert (bei Index {2}).
es_es: ''{0}'': Parámetro de la especificación de acceso ''{1}'' definido previamente (en el índice ''{2}).
it_it: ''{0}'': Parametro per la specifica di accesso ''{1}'' precedentemente definito (all''indice {2}).
ja_jp: ''{0}'': アクセス仕様 ''{1}'' のパラメーターは、前に定義されました (索引 {2} で)。
ko_kr: ''{0}'': 액세스 스펙 ''{1}''의 매개변수가 이전에 정의된 매개변수입니다(위치: 인덱스 {2}).

# CDIST1307E
source: ''{0}'': Parameter for access specification ''{1}'' supplied to ''{2}'' operator expects at least one value.
de_de: ''{0}'': Für den Parameter für Zugriffsspezifikation ''{1}'', der für Operator ''{2}'' bereitgestellt wurde, wird mindestens ein Wert erwartet.
es_es: ''{0}'': El parámetro de la especificación de acceso ''{1}'' pasado al operador ''{2}'' necesita un valor como mínimo.
it_it: ''{0}'': Il parametro per la specifica di accesso ''{1}'' fornito all''operatore ''{2}'' prevede almeno un valore.
ja_jp: ''{0}'': ''{2}'' オペレーターに提供されたアクセス仕様 ''{1}'' のパラメーターは、少なくとも 1 つの値を想定しています。
ko_kr: ''{0}'': ''{2}'' 연산자에 제공되는 액세스 스펙 ''{1}''의 매개변수는 하나 이상의 값을 예상합니다.

# CDIST1308E
source: ''{0}'': Parameter for access specification ''{1}'' supplied to ''{2}'' operator expects {3} value(s).
de_de: ''{0}'': Der an den Operator ''{2}'' übergebene Parameter für die Zugriffsspezifikation ''{1}'' erwartet {3} Wert(e).
es_es: ''{0}'': el parámetro para la especificación de acceso ''{1}'' proporcionado al operador ''{2}'' espera {3} valor(es).
it_it: ''{0}'': Il parametro per la specifica di accesso ''{1}'' fornito all''operatore ''{2}'' prevede {3} valori.
ja_jp: ''{0}'': ''{2}'' オペレーターに提供されたアクセス仕様 ''{1}'' のパラメーターは、''{3}'' 個の値を想定しています。
ko_kr: ''{0}'': ''{2}'' 연산자에 제공되는 액세스 스펙 ''{1}''의 매개변수는 {3}개의 값을 예상합니다.

# CDIST1309E
source: ''{0}'' operator expects type base ''{1}'' (not ''{2}'') for value of parameter ''{3}'' from access specification ''{4}''.
de_de: Operator ''{0}'' erwartet Typbasis ''{1}'' anstatt ''{2}'' für den Wert des Parameters ''{3}'' aus Zugriffsspezifikation ''{4}''.
es_es: El operador ''{0}'' espera el tipo base ''{1}'' (no ''{2}'') como valor del parámetro ''{3}'' de la especificación de acceso ''{4}''.
it_it: L''operatore ''{0}'' prevede una base tipo ''{1}'' (non ''{2}'') per il valore del parametro ''{3}'' dalla specifica di accesso ''{4}''.
ja_jp: ''{0}'' オペレーターは、アクセス仕様 ''{4}'' からのパラメーター ''{3}'' の値に、タイプ・ベース ''{1}'' (''{2}'' ではなく) を想定しています。
ko_kr: ''{0}'' 연산자는 액세스 스펙 ''{4}''에 포함된 매개변수 ''{3}''의 값에 대해 ''{1}''의 유형 기본(''{2}'' 아님)을 예상합니다.

# CDIST1310E
source: ''{0}'' operator expects mandatory parameter ''{1}'' for access specification ''{2}''.
de_de: Operator ''{0}'' erwartet obligatorischen Parameter ''{1}'' für Zugriffsspezifikation ''{2}''.
es_es: El operador ''{0}'' espera el parámetro obligatorio ''{1}'' para la especificación de acceso ''{2}''.
it_it: L''operatore ''{0}'' prevede il parametro obbligatorio ''{1}'' per la specifica di accesso ''{2}''.
ja_jp: ''{0}'' オペレーターは、アクセス仕様 ''{2}'' に必須パラメーター ''{1}'' を想定しています。
ko_kr: ''{0}'' 연산자는 액세스 스펙 ''{2}''에 대해 필수 매개변수 ''{1}''을(를) 예상합니다.

# CDIST1311E
source: ''{0}'' operator has an attribute named ''{1}'' in both its input stream and in the native schema for access specification ''{2}''.
de_de: Operator ''{0}'' hat ein Attribut mit dem Namen ''{1}'' im Eingabedatenstrom und im nativen Schema für die Zugriffsspezifikation ''{2}''.
es_es: El operador ''{0}'' tiene un atributo denominado ''{1}'' tanto en la corriente de entrada como en el esquema nativo para la especificación de acceso ''{2}''.
it_it: L''operatore ''{0}'' ha un attributo denominato ''{1}'' sia nel flusso di input che nello schema nativo per la specifica di accesso ''{2}''.
ja_jp: ''{0}'' オペレーターは、入力ストリーム内とアクセス仕様 ''{2}'' のネイティブ・スキーマ内の両方に、属性 ''{1}'' を持っています。
ko_kr: ''{0}'' 연산자의 액세스 스펙 ''{2}''의 입력 스트림 및 원시(native) 스키마에 모두 이름이 ''{1}''인 속성이 있습니다.

# CDIST1312E
source: ''{0}'' operator: type mismatch between output stream attribute ''{1}'' and the native schema attribute of the same name in access specification ''{2}''.
de_de: Operator ''{0}'': keine Typübereinstimmung zwischen Ausgabedatenstromattribut ''{1}'' und dem nativen Schemaattribut mit demselben Namen in Zugriffsspezifikation ''{2}''.
es_es: Operador ''{0}'': no coincidencia de tipo entre el atributo de corriente de salida ''{1}'' y el atributo de esquema nativo del mismo nombre en la especificación de acceso ''{2}''.
it_it: Operatore ''{0}'': mancata corrispondenza di tipo tra l''attributo del flusso di output ''{1}'' e l''attributo dello schema nativo con lo stesso nome nella specifica di accesso ''{2}''.
ja_jp: ''{0}'' オペレーター: 出力ストリーム属性 ''{1}'' とアクセス仕様 ''{2}'' 内の同じ名前のネイティブ・スキーマ属性の間での、タイプの不一致。
ko_kr: ''{0}'' 연산자: 액세스 스펙 ''{2}''에서 출력 스트림 속성 ''{1}''과(와) 동일한 이름의 원시(native) 스키마 속성 간에 유형이 불일치합니다.

# CDIST1313E
source: ''{0}'' operator: no matching attribute name found in the input stream or in the native schema of access specification ''{1}'' for the output attribute ''{2}''.
de_de: Operator ''{0}'': Im Eingabedatenstrom oder im nativen Schema der Zugriffsspezifikation ''{1}'' wurde für das Ausgabeattribut ''{2}'' kein übereinstimmender Attributname gefunden.
es_es: Operador ''{0}'': no se ha encontrado ningún nombre de atributo coincidente en la corriente de entrada ni en el esquema nativo de la especificación de acceso ''{1}'' para el atributo de salida ''{2}''.
it_it: Operatore ''{0}'': nessun nome attributo corrispondente trovato nel flusso di input o nello schema nativo della specifica di accesso ''{1}'' per l''attributo di output ''{2}''.
ja_jp: ''{0}'' オペレーター: 入力ストリーム内、または出力属性 ''{2}'' のアクセス仕様 ''{1}'' のネイティブ・スキーマ内で、一致する属性名が見つかりません。
ko_kr: ''{0}'' 연산자: 액세스 스펙 ''{1}''의 입력 스트림 또는 원시(native) 스키마에서 출력 속성 ''{2}''과(와) 일치하는 속성 이름을 찾지 못했습니다.

# CDIST1314E
source: ''{0}'' operator: no matching attribute name found in the native schema of access specification ''{1}'' for the output attribute ''{2}''
de_de: Operator ''{0}'': Im nativen Schema der Zugriffsspezifikation ''{1}'' wurde für das Ausgabeattribut ''{2}'' kein übereinstimmender Attributname gefunden.
es_es: Operador ''{0}'': no se ha encontrado ningún nombre de atributo coincidente en el esquema nativo de la especificación de acceso ''{1}'' para el atributo de salida ''{2}''.
it_it: Operatore ''{0}'': nessun nome attributo corrispondente trovato nello schema nativo della specifica di accesso ''{1}'' per l''attributo di output ''{2}''
ja_jp: ''{0}'' オペレーター: 出力属性 ''{2}'' のアクセス仕様 ''{1}'' のネイティブ・スキーマ内で、一致する属性名が見つかりません。
ko_kr: ''{0}'' 연산자: 액세스 스펙 ''{1}''의 원시(native) 스키마에서 출력 속성 ''{2}''과(와) 일치하는 속성 이름을 찾지 못했습니다.

# CDIST1315E
source: Operator ''{0}'': reconnectionBound parameter can only appear if reconnectionPolicy is ''BoundedRetry''.
de_de: Operator ''{0}'': reconnectionBound wird nur angezeigt, wenn reconnectionPolicy auf ''BoundedRetry'' gesetzt ist.
es_es: Operador ''{0}'': el parámetro reconnectionBound sólo puede aparecer si reconnectionPolicy es ''BoundedRetry''.
it_it: Operatore ''{0}'': il parametro reconnectionBound può essere presente solo se reconnectionPolicy è ''BoundedRetry''.
ja_jp: オペレーター ''{0}'': reconnectionBound パラメーターは、reconnectionPolicy が ''BoundedRetry'' の場合にのみ指定できます。
ko_kr: 연산자 ''{0}'': reconnectionPolicy가 ''BoundedRetry''인 경우에만 reconnectionBound 매개변수가 표시됩니다.

# CDIST1316E
source: Operator ''{0}'': reconnectionBound cannot be negative.
de_de: Operator ''{0}'': reconnectionBound darf nicht negativ sein.
es_es: Operador ''{0}'': reconnectionBound no puede ser negativo.
it_it: Operatore ''{0}'': reconnectionBound non può essere negativo.
ja_jp: オペレーター ''{0}'': reconnectionBound を負数にすることはできません。
ko_kr: 연산자 ''{0}'': reconnectionBound는 음수일 수 없습니다.

# CDIST1317E
source: Operator ''{0}'': period parameter can only appear if reconnectionPolicy is specified.
de_de: Operator ''{0}'': Parameter ''period'' kann nur angezeigt werden, wenn ''reconnectionPolicy'' angegeben ist.
es_es: Operador ''{0}'': el parámetro period sólo puede aparecer si se especifica reconnectionPolicy.
it_it: Operatore ''{0}'': il parametro period può essere presente solo se è specificato reconnectionPolicy.
ja_jp: オペレーター ''{0}'': period パラメーターは、reconnectionPolicy が指定された場合にのみ指定できます。
ko_kr: 연산자 ''{0}'': reconnectionPolicy가 지정된 경우에만 기간 매개변수가 표시됩니다.

# CDIST1318E
source: Operator ''{0}'': unable to use message class ''{1}'' in access specification {2} if native schema attributes have been supplied.
de_de: Operator ''{0}'': Nachrichtenklasse ''{1}'' kann in Zugriffsspezifikation {2} nicht verwendet werden, wenn native Schemaattribute angewendet wurden.
es_es: Operador ''{0}'': no se puede utilizar la clase de mensaje ''{1}'' en la especificación de acceso {2} si se han proporcionado atributos de esquema nativo.
it_it: Operatore ''{0}'': impossibile utilizzare la classe di messaggi ''{1}'' nella specifica di accesso {2} se sono stati forniti attributi dello schema nativo.
ja_jp: オペレーター ''{0}'': ネイティブ・スキーマ属性が指定されている場合、アクセス仕様 {2} にメッセージ・クラス ''{1}'' を使用できません。
ko_kr: 연산자 ''{0}'': 원시(native) 스키마 속성을 제공한 경우 액세스 스펙 {2}에서 메시지 클래스 ''{1}''을(를) 사용할 수 없습니다.

# CDIST1319E
source: Operator ''{0}'': The tuple attributes defined in the error stream do not match the tuple which is received.
de_de: Operator ''{0}'': die im Fehlerdatenstrom definierten Tupelattribute stimmen nicht mit dem empfangenen Tupel überein.
es_es: Operador ''{0}'': los atributos de tupla definidos en la corriente de error no coinciden con la tupla recibida.
it_it: Operatore ''{0}'': gli attributi tupla definiti nel flusso di errore non corrispondono alla tupla ricevuta.
ja_jp: オペレーター ''{0}'': エラー・ストリームに定義されたタプル属性が、受け取ったタプルに一致しません。
ko_kr: 연산자 ''{0}'': 오류 스트림에 정의된 튜플 속성이 수신된 튜플과 일치하지 않습니다.

# CDIST1320E
source: Operator ''{0}'': The error output port can only contain an rstring.
de_de: Operator ''{0}'': Der Port für Fehlernachrichten kann nur einen rstring-Wert enthalten.
es_es: Operador ''{0}'': el puerto de salida de error sólo puede contener una rstring.
it_it: Operatore ''{0}'': la porta di output di errore può contenere solo un rstring.
ja_jp: オペレーター ''{0}'': エラー出力ポートは、rstring のみを含むことができます。
ko_kr: 연산자 ''{0}'': 오류 출력 포트에 rstring만 포함될 수 있습니다.

# CDIST1321E
source: Operator ''{0}'': native schema attribute ''{1}'' in access specification {2} must not have a length specification.
de_de: Operator ''{0}'': Das native Schemaattribut ''{1}'' in der Zugriffsspezifikation {2} darf keine Längenspezifikation haben.
es_es: Operador ''{0}'': el atributo de esquema nativo ''{1}'' en la especificación de acceso {2} no debe tener una especificación de longitud.
it_it: Operatore ''{0}'': l''attributo dello schema nativo ''{1}'' nella specifica di accesso {2} non deve avere una specifica di lunghezza.
ja_jp: オペレーター ''{0}'': アクセス仕様 {2} のネイティブ・スキーマ属性 ''{1}'' に、長さ指定があってはなりません。
ko_kr: 연산자 ''{0}'': 액세스 스펙 {2}의 원시(native) 스키마 속성 ''{1}''에 길이 스펙이 포함되면 안 됩니다.

# CDIST1322E
source: Operator ''{0}'': Stream schema attribute ''{1}'' is not a supported data type.
de_de: Operator ''{0}'': Das Datenstromschemaattribut ''{1}'' weist keinen unterstützten Datentyp auf.
es_es: Operador ''{0}'': el atributo de esquema de corriente ''{1}'' no es un tipo de datos soportado.
it_it: Operatore ''{0}'': l''attributo dello schema del flusso ''{1}'' non è un tipo di dati supportato.
ja_jp: オペレーター ''{0}'': ストリーム・スキーマ属性 ''{1}'' は、サポートされるデータ・タイプではありません。
ko_kr: 연산자 ''{0}'': 스트림 스키마 속성 ''{1}''은(는) 지원되는 데이터 유형이 아닙니다.

# CDIST1323E
source: Operator ''{0}'': native schema attribute ''{1}'' in access specification {2} has type ''{3}'' which does not match the attribute in the input stream schema.
de_de: Operator ''{0}'': natives Schemaattribut ''{1}'' in Zugriffsspezifikation {2} hat Typ ''{3}'', was nicht mit dem Attribut im Eingabedatenstromschema übereinstimmt.
es_es: Operador ''{0}'': el atributo de esquema nativo ''{1}'' en la especificación de acceso {2} tiene el tipo ''{3}'' que no coincide con el atributo en el esquema de corriente de entrada.
it_it: Operatore ''{0}'': l''attributo dello schema nativo ''{1}'' nella specifica di accesso {2} ha il tipo ''{3}'' che non corrisponde all''attributo nello schema del flusso di input.
ja_jp: オペレーター ''{0}'': アクセス仕様 {2} のネイティブ・スキーマ属性 ''{1}'' のタイプは ''{3}'' で、入力ストリーム・スキーマの属性に一致しません。
ko_kr: 연산자 ''{0}'': 액세스 스펙 {2}의 원시(native) 스키마 속성 ''{1}''에 입력 스트림 스키마의 속성과 일치하지 않는 ''{3}'' 유형이 있습니다.

# CDIST1324E
source: Operator ''{0}'': native schema attribute ''{1}'' in access specification {2} has type ''{3}'' which does not match the attribute in the input stream schema.
de_de: Operator ''{0}'': natives Schemaattribut ''{1}'' in Zugriffsspezifikation {2} hat Typ ''{3}'', was nicht mit dem Attribut im Eingabedatenstromschema übereinstimmt.
es_es: Operador ''{0}'': el atributo de esquema nativo ''{1}'' en la especificación de acceso {2} tiene el tipo ''{3}'' que no coincide con el atributo en el esquema de corriente de entrada.
it_it: Operatore ''{0}'': l''attributo dello schema nativo ''{1}'' nella specifica di accesso {2} ha il tipo ''{3}'' che non corrisponde all''attributo nello schema del flusso di input.
ja_jp: オペレーター ''{0}'': アクセス仕様 {2} のネイティブ・スキーマ属性 ''{1}'' のタイプは ''{3}'' で、入力ストリーム・スキーマの属性に一致しません。
ko_kr: 연산자 ''{0}'': 액세스 스펙 {2}의 원시(native) 스키마 속성 ''{1}''에 입력 스트림 스키마의 속성과 일치하지 않는 ''{3}'' 유형이 있습니다.

# CDIST1325E
source: Operator ''{0}'': native schema attribute ''{1}'' in access specification {2} has no matching attribute in the input stream schema.
de_de: Operator ''{0}'': Für das native Schemaattribut ''{1}'' in der Zugriffsspezifikation {2} gibt es kein übereinstimmendes Attribut im Eingabedatenstromschema.
es_es: Operador ''{0}'': el atributo de esquema nativo ''{1}'' en la especificación de acceso {2} no tiene ningún atributo coincidente en el esquema de corriente de entrada.
it_it: Operatore ''{0}'': l''attributo dello schema nativo ''{1}'' nella specifica di accesso {2} non ha alcun attributo corrispondente nello schema del flusso di input.
ja_jp: オペレーター ''{0}'': アクセス仕様 {2} のネイティブ・スキーマ属性 ''{1}'' には、入力ストリーム・スキーマに一致する属性がありません。
ko_kr: 연산자 ''{0}'': 액세스 스펙 {2}의 원시(native) 스키마 속성 ''{1}''이(가) 입력 스트림 스키마의 속성과 일치하지 않습니다.

# CDIST1326E
source: Operator ''{0}'': native schema attribute ''{1}'' defined twice in access specification {2}.
de_de: Operator ''{0}'': Natives Schemaattribut ''{1}'' in Zugriffsspezifikation {2} zweimal definiert.
es_es: Operador ''{0}'': el atributo de esquema nativo ''{1}'' definido dos veces en la especificación de acceso {2}.
it_it: Operatore ''{0}'': l''attributo dello schema nativo ''{1}'' è definito due volte nella specifica di accesso {2}.
ja_jp: オペレーター ''{0}'': ネイティブ・スキーマ属性 ''{1}'' は、アクセス仕様 {2} で 2 回定義されています。
ko_kr: 연산자 ''{0}'': 원시(native) 스키마 속성 ''{1}''이(가) 액세스 스펙 {2}에 두 번 정의되어 있습니다.

# CDIST1327E
source: Operator ''{0}'': native schema attribute {1} in access specification {2} should not have a negative length.
de_de: Operator ''{0}'': Das native Schemaattribut {1} in der Zugriffsspezifikation {2} darf keine negative Länge haben.
es_es: Operador ''{0}'': el atributo de esquema nativo {1} en la especificación de acceso {2} no debe tener una longitud negativa.
it_it: Operatore ''{0}'': l''attributo dello schema nativo {1} nella specifica di accesso {2} non deve avere una lunghezza negativa.
ja_jp: オペレーター ''{0}'': アクセス仕様 {2} のネイティブ・スキーマ属性 {1} は、負の長さにしないでください。
ko_kr: 연산자 ''{0}'': 액세스 스펙 {2}의 원시(native) 스키마 속성 {1}에 음수 길이가 포함되면 안 됩니다.

# CDIST1328E
source: Operator ''{0}'': native schema attribute {1} in access specification {2} cannot have any other negative values than -2,-4 and -8.
de_de: Operator ''{0}'': Das native Schemaattribut {1} in der Zugriffsspezifikation {2} darf keine anderen negativen Wert als -2, -4 und -8 haben.
es_es: Operador ''{0}'': el atributo de esquema nativo {1} en la especificación de acceso {2} no puede tener valores negativos excepto -2,-4 y -8.
it_it: Operatore ''{0}'': l''attributo dello schema nativo {1} nella specifica di accesso {2} non può avere altri valori negativi diversi da -2, -4 e -8.
ja_jp: オペレーター ''{0}'': アクセス仕様 {2} のネイティブ・スキーマ属性 {1} は、-2、-4、および -8 以外の負の値にすることはできません.
ko_kr: 연산자 ''{0}'': 액세스 스펙 {2}의 원시(native) 스키마 속성 {1}에 -2, -4 및 -8 외의 다른 음수 값이 포함되면 안 됩니다.
